/* automatically generated by rust-bindgen 0.60.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const IPOPT_SECUR_MMMM: u32 = 48205;
pub const IPOPT_SECUR_RESTR: u32 = 44819;
pub const IPOPT_SECUR_SECRET: u32 = 55176;
pub const IPOPT_SECUR_TOPSECRET: u32 = 27589;
pub const MAXTTL: u32 = 255;
pub const IPDEFTTL: u32 = 64;
pub const IPFRAGTTL: u32 = 60;
pub const IPTTLDEC: u32 = 1;
pub const IP_MSS: u32 = 576;
pub const __NETINET_UDP_H: u32 = 1;
pub const UDP_CORK: u32 = 1;
pub const UDP_ENCAP: u32 = 100;
pub const UDP_NO_CHECK6_TX: u32 = 101;
pub const UDP_NO_CHECK6_RX: u32 = 102;
pub const UDP_SEGMENT: u32 = 103;
pub const UDP_GRO: u32 = 104;
pub const UDP_ENCAP_ESPINUDP_NON_IKE: u32 = 1;
pub const UDP_ENCAP_ESPINUDP: u32 = 2;
pub const UDP_ENCAP_L2TPINUDP: u32 = 3;
pub const UDP_ENCAP_GTP0: u32 = 4;
pub const UDP_ENCAP_GTP1U: u32 = 5;
pub const SOL_UDP: u32 = 17;
pub const _ASSERT_H: u32 = 1;
pub const ZFUT_FLAG_DONT_FRAGMENT: u32 = 16384;
pub const ZF_PKT_REPORT_CLOCK_SET: u32 = 1;
pub const ZF_PKT_REPORT_IN_SYNC: u32 = 2;
pub const ZF_PKT_REPORT_NO_TIMESTAMP: u32 = 4;
pub const ZF_PKT_REPORT_DROPPED: u32 = 8;
pub const ZF_PKT_REPORT_TCP_RETRANS: u32 = 8192;
pub const ZF_PKT_REPORT_TCP_SYN: u32 = 16384;
pub const ZF_PKT_REPORT_TCP_FIN: u32 = 32768;
pub const ZF_DELEGATED_SEND_RC_FATAL: u32 = 128;
pub const TCP_OFFSET_SEQ_TO_FLAGS: u32 = 9;
pub const TCP_FLAG_PSH: u32 = 8;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    fn test_field___val() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__fsid_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__fsid_t),
                "::",
                stringify!(__val)
            )
        );
    }
    test_field___val();
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type __gwchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    assert_eq!(
        ::std::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    fn test_field_quot() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<imaxdiv_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(imaxdiv_t),
                "::",
                stringify!(quot)
            )
        );
    }
    test_field_quot();
    fn test_field_rem() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<imaxdiv_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(imaxdiv_t),
                "::",
                stringify!(rem)
            )
        );
    }
    test_field_rem();
}
extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
pub type size_t = ::std::os::raw::c_ulong;
pub type clock_t = __clock_t;
pub type time_t = __time_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    assert_eq!(
        ::std::mem::size_of::<tm>(),
        56usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::std::mem::align_of::<tm>(),
        8usize,
        concat!("Alignment of ", stringify!(tm))
    );
    fn test_field_tm_sec() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<tm>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tm_sec) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(tm),
                "::",
                stringify!(tm_sec)
            )
        );
    }
    test_field_tm_sec();
    fn test_field_tm_min() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<tm>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tm_min) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(tm),
                "::",
                stringify!(tm_min)
            )
        );
    }
    test_field_tm_min();
    fn test_field_tm_hour() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<tm>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tm_hour) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(tm),
                "::",
                stringify!(tm_hour)
            )
        );
    }
    test_field_tm_hour();
    fn test_field_tm_mday() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<tm>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tm_mday) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(tm),
                "::",
                stringify!(tm_mday)
            )
        );
    }
    test_field_tm_mday();
    fn test_field_tm_mon() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<tm>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tm_mon) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(tm),
                "::",
                stringify!(tm_mon)
            )
        );
    }
    test_field_tm_mon();
    fn test_field_tm_year() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<tm>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tm_year) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(tm),
                "::",
                stringify!(tm_year)
            )
        );
    }
    test_field_tm_year();
    fn test_field_tm_wday() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<tm>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tm_wday) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(tm),
                "::",
                stringify!(tm_wday)
            )
        );
    }
    test_field_tm_wday();
    fn test_field_tm_yday() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<tm>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tm_yday) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(tm),
                "::",
                stringify!(tm_yday)
            )
        );
    }
    test_field_tm_yday();
    fn test_field_tm_isdst() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<tm>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tm_isdst) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(tm),
                "::",
                stringify!(tm_isdst)
            )
        );
    }
    test_field_tm_isdst();
    fn test_field_tm_gmtoff() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<tm>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tm_gmtoff) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(tm),
                "::",
                stringify!(tm_gmtoff)
            )
        );
    }
    test_field_tm_gmtoff();
    fn test_field_tm_zone() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<tm>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tm_zone) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(tm),
                "::",
                stringify!(tm_zone)
            )
        );
    }
    test_field_tm_zone();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    fn test_field_tv_sec() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<timespec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(timespec),
                "::",
                stringify!(tv_sec)
            )
        );
    }
    test_field_tv_sec();
    fn test_field_tv_nsec() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<timespec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(timespec),
                "::",
                stringify!(tv_nsec)
            )
        );
    }
    test_field_tv_nsec();
}
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    assert_eq!(
        ::std::mem::size_of::<itimerspec>(),
        32usize,
        concat!("Size of: ", stringify!(itimerspec))
    );
    assert_eq!(
        ::std::mem::align_of::<itimerspec>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerspec))
    );
    fn test_field_it_interval() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<itimerspec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).it_interval) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(itimerspec),
                "::",
                stringify!(it_interval)
            )
        );
    }
    test_field_it_interval();
    fn test_field_it_value() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<itimerspec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).it_value) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(itimerspec),
                "::",
                stringify!(it_value)
            )
        );
    }
    test_field_it_value();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigevent {
    _unused: [u8; 0],
}
pub type pid_t = __pid_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    fn test_field___locales() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__locale_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__locales) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__locale_struct),
                "::",
                stringify!(__locales)
            )
        );
    }
    test_field___locales();
    fn test_field___ctype_b() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__locale_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__ctype_b) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(__locale_struct),
                "::",
                stringify!(__ctype_b)
            )
        );
    }
    test_field___ctype_b();
    fn test_field___ctype_tolower() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__locale_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__ctype_tolower) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(__locale_struct),
                "::",
                stringify!(__ctype_tolower)
            )
        );
    }
    test_field___ctype_tolower();
    fn test_field___ctype_toupper() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__locale_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__ctype_toupper) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(__locale_struct),
                "::",
                stringify!(__ctype_toupper)
            )
        );
    }
    test_field___ctype_toupper();
    fn test_field___names() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__locale_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__names) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(__locale_struct),
                "::",
                stringify!(__names)
            )
        );
    }
    test_field___names();
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn clock() -> clock_t;
}
extern "C" {
    pub fn time(__timer: *mut time_t) -> time_t;
}
extern "C" {
    pub fn difftime(__time1: time_t, __time0: time_t) -> f64;
}
extern "C" {
    pub fn mktime(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn strftime(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: size_t,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
    ) -> size_t;
}
extern "C" {
    pub fn strftime_l(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: size_t,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
        __loc: locale_t,
    ) -> size_t;
}
extern "C" {
    pub fn gmtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn localtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn gmtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn localtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn asctime(__tp: *const tm) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime(__timer: *const time_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn asctime_r(
        __tp: *const tm,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime_r(
        __timer: *const time_t,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub static mut __tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    pub static mut __daylight: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut __timezone: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    pub fn tzset();
}
extern "C" {
    pub static mut daylight: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut timezone: ::std::os::raw::c_long;
}
extern "C" {
    pub fn timegm(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn timelocal(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn dysize(__year: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nanosleep(
        __requested_time: *const timespec,
        __remaining: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_nanosleep(
        __clock_id: clockid_t,
        __flags: ::std::os::raw::c_int,
        __req: *const timespec,
        __rem: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getcpuclockid(__pid: pid_t, __clock_id: *mut clockid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_create(
        __clock_id: clockid_t,
        __evp: *mut sigevent,
        __timerid: *mut timer_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_delete(__timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_settime(
        __timerid: timer_t,
        __flags: ::std::os::raw::c_int,
        __value: *const itimerspec,
        __ovalue: *mut itimerspec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_gettime(__timerid: timer_t, __value: *mut itimerspec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_getoverrun(__timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timespec_get(
        __ts: *mut timespec,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type id_t = __id_t;
pub type ssize_t = __ssize_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    fn test_field___val() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sigset_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__sigset_t),
                "::",
                stringify!(__val)
            )
        );
    }
    test_field___val();
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    fn test_field_tv_sec() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<timeval>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(timeval),
                "::",
                stringify!(tv_sec)
            )
        );
    }
    test_field_tv_sec();
    fn test_field_tv_usec() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<timeval>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(timeval),
                "::",
                stringify!(tv_usec)
            )
        );
    }
    test_field_tv_usec();
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    fn test_field___fds_bits() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<fd_set>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__fds_bits) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(fd_set),
                "::",
                stringify!(__fds_bits)
            )
        );
    }
    test_field___fds_bits();
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    fn test_field___prev() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_internal_list>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__prev) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_internal_list),
                "::",
                stringify!(__prev)
            )
        );
    }
    test_field___prev();
    fn test_field___next() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_internal_list>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_internal_list),
                "::",
                stringify!(__next)
            )
        );
    }
    test_field___next();
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    fn test_field___next() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_internal_slist>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_internal_slist),
                "::",
                stringify!(__next)
            )
        );
    }
    test_field___next();
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    fn test_field___lock() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__lock) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__lock)
            )
        );
    }
    test_field___lock();
    fn test_field___count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__count)
            )
        );
    }
    test_field___count();
    fn test_field___owner() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__owner) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__owner)
            )
        );
    }
    test_field___owner();
    fn test_field___nusers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__nusers) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__nusers)
            )
        );
    }
    test_field___nusers();
    fn test_field___kind() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__kind) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__kind)
            )
        );
    }
    test_field___kind();
    fn test_field___spins() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__spins) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__spins)
            )
        );
    }
    test_field___spins();
    fn test_field___elision() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__elision) as usize - ptr as usize
            },
            22usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__elision)
            )
        );
    }
    test_field___elision();
    fn test_field___list() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__list) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__list)
            )
        );
    }
    test_field___list();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    fn test_field___readers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__readers) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__readers)
            )
        );
    }
    test_field___readers();
    fn test_field___writers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__writers) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__writers)
            )
        );
    }
    test_field___writers();
    fn test_field___wrphase_futex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__wrphase_futex) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__wrphase_futex)
            )
        );
    }
    test_field___wrphase_futex();
    fn test_field___writers_futex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__writers_futex) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__writers_futex)
            )
        );
    }
    test_field___writers_futex();
    fn test_field___pad3() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__pad3) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__pad3)
            )
        );
    }
    test_field___pad3();
    fn test_field___pad4() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__pad4) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__pad4)
            )
        );
    }
    test_field___pad4();
    fn test_field___cur_writer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__cur_writer) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__cur_writer)
            )
        );
    }
    test_field___cur_writer();
    fn test_field___shared() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__shared) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__shared)
            )
        );
    }
    test_field___shared();
    fn test_field___rwelision() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__rwelision) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__rwelision)
            )
        );
    }
    test_field___rwelision();
    fn test_field___pad1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__pad1) as usize - ptr as usize
            },
            33usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__pad1)
            )
        );
    }
    test_field___pad1();
    fn test_field___pad2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__pad2) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__pad2)
            )
        );
    }
    test_field___pad2();
    fn test_field___flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__flags) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__flags)
            )
        );
    }
    test_field___flags();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: ::std::os::raw::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    fn test_field___low() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__low) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(__low)
            )
        );
    }
    test_field___low();
    fn test_field___high() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__high) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(__high)
            )
        );
    }
    test_field___high();
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    fn test_field___wseq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__wseq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s__bindgen_ty_1),
                "::",
                stringify!(__wseq)
            )
        );
    }
    test_field___wseq();
    fn test_field___wseq32() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__wseq32) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s__bindgen_ty_1),
                "::",
                stringify!(__wseq32)
            )
        );
    }
    test_field___wseq32();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: ::std::os::raw::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    fn test_field___low() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__low) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
                "::",
                stringify!(__low)
            )
        );
    }
    test_field___low();
    fn test_field___high() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__high) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
                "::",
                stringify!(__high)
            )
        );
    }
    test_field___high();
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    fn test_field___g1_start() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__g1_start) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s__bindgen_ty_2),
                "::",
                stringify!(__g1_start)
            )
        );
    }
    test_field___g1_start();
    fn test_field___g1_start32() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__g1_start32) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s__bindgen_ty_2),
                "::",
                stringify!(__g1_start32)
            )
        );
    }
    test_field___g1_start32();
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    fn test_field___g_refs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__g_refs) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s),
                "::",
                stringify!(__g_refs)
            )
        );
    }
    test_field___g_refs();
    fn test_field___g_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__g_size) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s),
                "::",
                stringify!(__g_size)
            )
        );
    }
    test_field___g_size();
    fn test_field___g1_orig_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__g1_orig_size) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s),
                "::",
                stringify!(__g1_orig_size)
            )
        );
    }
    test_field___g1_orig_size();
    fn test_field___wrefs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__wrefs) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s),
                "::",
                stringify!(__wrefs)
            )
        );
    }
    test_field___wrefs();
    fn test_field___g_signals() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__g_signals) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s),
                "::",
                stringify!(__g_signals)
            )
        );
    }
    test_field___g_signals();
}
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___once_flag() {
    assert_eq!(
        ::std::mem::size_of::<__once_flag>(),
        4usize,
        concat!("Size of: ", stringify!(__once_flag))
    );
    assert_eq!(
        ::std::mem::align_of::<__once_flag>(),
        4usize,
        concat!("Alignment of ", stringify!(__once_flag))
    );
    fn test_field___data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__once_flag>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__once_flag),
                "::",
                stringify!(__data)
            )
        );
    }
    test_field___data();
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_mutexattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_mutexattr_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_mutexattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_mutexattr_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_condattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_condattr_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_condattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_condattr_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_attr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_attr_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_attr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_attr_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    fn test_field___data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_mutex_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_mutex_t),
                "::",
                stringify!(__data)
            )
        );
    }
    test_field___data();
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_mutex_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_mutex_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_mutex_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_mutex_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    fn test_field___data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_cond_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_cond_t),
                "::",
                stringify!(__data)
            )
        );
    }
    test_field___data();
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_cond_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_cond_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_cond_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_cond_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    fn test_field___data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_rwlock_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_rwlock_t),
                "::",
                stringify!(__data)
            )
        );
    }
    test_field___data();
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_rwlock_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_rwlock_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_rwlock_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_rwlock_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_rwlockattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_rwlockattr_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_rwlockattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_rwlockattr_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_barrier_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_barrier_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_barrier_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_barrier_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_barrierattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_barrierattr_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_barrierattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_barrierattr_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: size_t,
}
#[test]
fn bindgen_test_layout_iovec() {
    assert_eq!(
        ::std::mem::size_of::<iovec>(),
        16usize,
        concat!("Size of: ", stringify!(iovec))
    );
    assert_eq!(
        ::std::mem::align_of::<iovec>(),
        8usize,
        concat!("Alignment of ", stringify!(iovec))
    );
    fn test_field_iov_base() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<iovec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).iov_base) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(iovec),
                "::",
                stringify!(iov_base)
            )
        );
    }
    test_field_iov_base();
    fn test_field_iov_len() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<iovec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).iov_len) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(iovec),
                "::",
                stringify!(iov_len)
            )
        );
    }
    test_field_iov_len();
}
extern "C" {
    pub fn readv(
        __fd: ::std::os::raw::c_int,
        __iovec: *const iovec,
        __count: ::std::os::raw::c_int,
    ) -> ssize_t;
}
extern "C" {
    pub fn writev(
        __fd: ::std::os::raw::c_int,
        __iovec: *const iovec,
        __count: ::std::os::raw::c_int,
    ) -> ssize_t;
}
extern "C" {
    pub fn preadv(
        __fd: ::std::os::raw::c_int,
        __iovec: *const iovec,
        __count: ::std::os::raw::c_int,
        __offset: __off_t,
    ) -> ssize_t;
}
extern "C" {
    pub fn pwritev(
        __fd: ::std::os::raw::c_int,
        __iovec: *const iovec,
        __count: ::std::os::raw::c_int,
        __offset: __off_t,
    ) -> ssize_t;
}
extern "C" {
    pub fn __errno_location() -> *mut ::std::os::raw::c_int;
}
pub type ef_driver_handle = ::std::os::raw::c_int;
pub type ef_eventq_ptr = u32;
pub type ef_addr = u64;
pub type ef_vi_ioaddr_t = *mut ::std::os::raw::c_char;
pub type ef_addrspace = u64;
pub type ef_request_id = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union ef_event {
    pub generic: ef_event__bindgen_ty_1,
    pub rx: ef_event__bindgen_ty_2,
    pub rx_discard: ef_event__bindgen_ty_3,
    pub tx: ef_event__bindgen_ty_4,
    pub tx_error: ef_event__bindgen_ty_5,
    pub tx_timestamp: ef_event__bindgen_ty_6,
    pub tx_alt: ef_event__bindgen_ty_7,
    pub rx_no_desc_trunc: ef_event__bindgen_ty_8,
    pub rx_packed_stream: ef_event__bindgen_ty_9,
    pub sw: ef_event__bindgen_ty_10,
    pub rx_multi: ef_event__bindgen_ty_11,
    pub rx_multi_discard: ef_event__bindgen_ty_12,
    pub rx_multi_pkts: ef_event__bindgen_ty_13,
    pub memcpy: ef_event__bindgen_ty_14,
    pub rx_ref: ef_event__bindgen_ty_15,
    pub rx_ref_discard: ef_event__bindgen_ty_16,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct ef_event__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub __bindgen_padding_0: u16,
}
#[test]
fn bindgen_test_layout_ef_event__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<ef_event__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(ef_event__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_event__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_event__bindgen_ty_1))
    );
}
impl ef_event__bindgen_ty_1 {
    #[inline]
    pub fn type_(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(type_: ::std::os::raw::c_uint) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct ef_event__bindgen_ty_2 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 14usize]>,
}
#[test]
fn bindgen_test_layout_ef_event__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<ef_event__bindgen_ty_2>(),
        16usize,
        concat!("Size of: ", stringify!(ef_event__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_event__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_event__bindgen_ty_2))
    );
}
impl ef_event__bindgen_ty_2 {
    #[inline]
    pub fn type_(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn q_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_q_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn __reserved(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set___reserved(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn rq_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 32u8) as u32) }
    }
    #[inline]
    pub fn set_rq_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub fn len(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(64usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_len(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(64usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn flags(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(80usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_flags(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(80usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn ofs(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(96usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_ofs(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(96usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: ::std::os::raw::c_uint,
        q_id: ::std::os::raw::c_uint,
        __reserved: ::std::os::raw::c_uint,
        rq_id: ::std::os::raw::c_uint,
        len: ::std::os::raw::c_uint,
        flags: ::std::os::raw::c_uint,
        ofs: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 14usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 14usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let q_id: u32 = unsafe { ::std::mem::transmute(q_id) };
            q_id as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let __reserved: u32 = unsafe { ::std::mem::transmute(__reserved) };
            __reserved as u64
        });
        __bindgen_bitfield_unit.set(32usize, 32u8, {
            let rq_id: u32 = unsafe { ::std::mem::transmute(rq_id) };
            rq_id as u64
        });
        __bindgen_bitfield_unit.set(64usize, 16u8, {
            let len: u32 = unsafe { ::std::mem::transmute(len) };
            len as u64
        });
        __bindgen_bitfield_unit.set(80usize, 16u8, {
            let flags: u32 = unsafe { ::std::mem::transmute(flags) };
            flags as u64
        });
        __bindgen_bitfield_unit.set(96usize, 16u8, {
            let ofs: u32 = unsafe { ::std::mem::transmute(ofs) };
            ofs as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct ef_event__bindgen_ty_3 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 14usize]>,
}
#[test]
fn bindgen_test_layout_ef_event__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<ef_event__bindgen_ty_3>(),
        16usize,
        concat!("Size of: ", stringify!(ef_event__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_event__bindgen_ty_3>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_event__bindgen_ty_3))
    );
}
impl ef_event__bindgen_ty_3 {
    #[inline]
    pub fn type_(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn q_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_q_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn __reserved(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set___reserved(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn rq_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 32u8) as u32) }
    }
    #[inline]
    pub fn set_rq_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub fn len(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(64usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_len(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(64usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn flags(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(80usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_flags(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(80usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn subtype(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(96usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_subtype(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(96usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: ::std::os::raw::c_uint,
        q_id: ::std::os::raw::c_uint,
        __reserved: ::std::os::raw::c_uint,
        rq_id: ::std::os::raw::c_uint,
        len: ::std::os::raw::c_uint,
        flags: ::std::os::raw::c_uint,
        subtype: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 14usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 14usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let q_id: u32 = unsafe { ::std::mem::transmute(q_id) };
            q_id as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let __reserved: u32 = unsafe { ::std::mem::transmute(__reserved) };
            __reserved as u64
        });
        __bindgen_bitfield_unit.set(32usize, 32u8, {
            let rq_id: u32 = unsafe { ::std::mem::transmute(rq_id) };
            rq_id as u64
        });
        __bindgen_bitfield_unit.set(64usize, 16u8, {
            let len: u32 = unsafe { ::std::mem::transmute(len) };
            len as u64
        });
        __bindgen_bitfield_unit.set(80usize, 16u8, {
            let flags: u32 = unsafe { ::std::mem::transmute(flags) };
            flags as u64
        });
        __bindgen_bitfield_unit.set(96usize, 16u8, {
            let subtype: u32 = unsafe { ::std::mem::transmute(subtype) };
            subtype as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct ef_event__bindgen_ty_4 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 6usize]>,
    pub __bindgen_padding_0: u16,
}
#[test]
fn bindgen_test_layout_ef_event__bindgen_ty_4() {
    assert_eq!(
        ::std::mem::size_of::<ef_event__bindgen_ty_4>(),
        8usize,
        concat!("Size of: ", stringify!(ef_event__bindgen_ty_4))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_event__bindgen_ty_4>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_event__bindgen_ty_4))
    );
}
impl ef_event__bindgen_ty_4 {
    #[inline]
    pub fn type_(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn q_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_q_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn flags(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_flags(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn desc_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_desc_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: ::std::os::raw::c_uint,
        q_id: ::std::os::raw::c_uint,
        flags: ::std::os::raw::c_uint,
        desc_id: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 6usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 6usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let q_id: u32 = unsafe { ::std::mem::transmute(q_id) };
            q_id as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let flags: u32 = unsafe { ::std::mem::transmute(flags) };
            flags as u64
        });
        __bindgen_bitfield_unit.set(32usize, 16u8, {
            let desc_id: u32 = unsafe { ::std::mem::transmute(desc_id) };
            desc_id as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct ef_event__bindgen_ty_5 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[test]
fn bindgen_test_layout_ef_event__bindgen_ty_5() {
    assert_eq!(
        ::std::mem::size_of::<ef_event__bindgen_ty_5>(),
        8usize,
        concat!("Size of: ", stringify!(ef_event__bindgen_ty_5))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_event__bindgen_ty_5>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_event__bindgen_ty_5))
    );
}
impl ef_event__bindgen_ty_5 {
    #[inline]
    pub fn type_(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn q_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_q_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn flags(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_flags(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn desc_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_desc_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn subtype(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(48usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_subtype(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(48usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: ::std::os::raw::c_uint,
        q_id: ::std::os::raw::c_uint,
        flags: ::std::os::raw::c_uint,
        desc_id: ::std::os::raw::c_uint,
        subtype: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let q_id: u32 = unsafe { ::std::mem::transmute(q_id) };
            q_id as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let flags: u32 = unsafe { ::std::mem::transmute(flags) };
            flags as u64
        });
        __bindgen_bitfield_unit.set(32usize, 16u8, {
            let desc_id: u32 = unsafe { ::std::mem::transmute(desc_id) };
            desc_id as u64
        });
        __bindgen_bitfield_unit.set(48usize, 16u8, {
            let subtype: u32 = unsafe { ::std::mem::transmute(subtype) };
            subtype as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct ef_event__bindgen_ty_6 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 16usize]>,
}
#[test]
fn bindgen_test_layout_ef_event__bindgen_ty_6() {
    assert_eq!(
        ::std::mem::size_of::<ef_event__bindgen_ty_6>(),
        16usize,
        concat!("Size of: ", stringify!(ef_event__bindgen_ty_6))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_event__bindgen_ty_6>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_event__bindgen_ty_6))
    );
}
impl ef_event__bindgen_ty_6 {
    #[inline]
    pub fn type_(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn q_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_q_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn flags(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_flags(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn rq_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 32u8) as u32) }
    }
    #[inline]
    pub fn set_rq_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub fn ts_sec(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(64usize, 32u8) as u32) }
    }
    #[inline]
    pub fn set_ts_sec(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(64usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub fn ts_nsec(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(96usize, 32u8) as u32) }
    }
    #[inline]
    pub fn set_ts_nsec(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(96usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: ::std::os::raw::c_uint,
        q_id: ::std::os::raw::c_uint,
        flags: ::std::os::raw::c_uint,
        rq_id: ::std::os::raw::c_uint,
        ts_sec: ::std::os::raw::c_uint,
        ts_nsec: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 16usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 16usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let q_id: u32 = unsafe { ::std::mem::transmute(q_id) };
            q_id as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let flags: u32 = unsafe { ::std::mem::transmute(flags) };
            flags as u64
        });
        __bindgen_bitfield_unit.set(32usize, 32u8, {
            let rq_id: u32 = unsafe { ::std::mem::transmute(rq_id) };
            rq_id as u64
        });
        __bindgen_bitfield_unit.set(64usize, 32u8, {
            let ts_sec: u32 = unsafe { ::std::mem::transmute(ts_sec) };
            ts_sec as u64
        });
        __bindgen_bitfield_unit.set(96usize, 32u8, {
            let ts_nsec: u32 = unsafe { ::std::mem::transmute(ts_nsec) };
            ts_nsec as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct ef_event__bindgen_ty_7 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 6usize]>,
    pub __bindgen_padding_0: u16,
}
#[test]
fn bindgen_test_layout_ef_event__bindgen_ty_7() {
    assert_eq!(
        ::std::mem::size_of::<ef_event__bindgen_ty_7>(),
        8usize,
        concat!("Size of: ", stringify!(ef_event__bindgen_ty_7))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_event__bindgen_ty_7>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_event__bindgen_ty_7))
    );
}
impl ef_event__bindgen_ty_7 {
    #[inline]
    pub fn type_(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn q_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_q_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn __reserved(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set___reserved(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn alt_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_alt_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: ::std::os::raw::c_uint,
        q_id: ::std::os::raw::c_uint,
        __reserved: ::std::os::raw::c_uint,
        alt_id: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 6usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 6usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let q_id: u32 = unsafe { ::std::mem::transmute(q_id) };
            q_id as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let __reserved: u32 = unsafe { ::std::mem::transmute(__reserved) };
            __reserved as u64
        });
        __bindgen_bitfield_unit.set(32usize, 16u8, {
            let alt_id: u32 = unsafe { ::std::mem::transmute(alt_id) };
            alt_id as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct ef_event__bindgen_ty_8 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
}
#[test]
fn bindgen_test_layout_ef_event__bindgen_ty_8() {
    assert_eq!(
        ::std::mem::size_of::<ef_event__bindgen_ty_8>(),
        4usize,
        concat!("Size of: ", stringify!(ef_event__bindgen_ty_8))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_event__bindgen_ty_8>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_event__bindgen_ty_8))
    );
}
impl ef_event__bindgen_ty_8 {
    #[inline]
    pub fn type_(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn q_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_q_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: ::std::os::raw::c_uint,
        q_id: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let q_id: u32 = unsafe { ::std::mem::transmute(q_id) };
            q_id as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct ef_event__bindgen_ty_9 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 9usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[test]
fn bindgen_test_layout_ef_event__bindgen_ty_9() {
    assert_eq!(
        ::std::mem::size_of::<ef_event__bindgen_ty_9>(),
        12usize,
        concat!("Size of: ", stringify!(ef_event__bindgen_ty_9))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_event__bindgen_ty_9>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_event__bindgen_ty_9))
    );
}
impl ef_event__bindgen_ty_9 {
    #[inline]
    pub fn type_(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn q_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_q_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn __reserved(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set___reserved(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn flags(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_flags(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn n_pkts(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(48usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_n_pkts(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(48usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn ps_flags(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(64usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_ps_flags(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(64usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: ::std::os::raw::c_uint,
        q_id: ::std::os::raw::c_uint,
        __reserved: ::std::os::raw::c_uint,
        flags: ::std::os::raw::c_uint,
        n_pkts: ::std::os::raw::c_uint,
        ps_flags: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 9usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 9usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let q_id: u32 = unsafe { ::std::mem::transmute(q_id) };
            q_id as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let __reserved: u32 = unsafe { ::std::mem::transmute(__reserved) };
            __reserved as u64
        });
        __bindgen_bitfield_unit.set(32usize, 16u8, {
            let flags: u32 = unsafe { ::std::mem::transmute(flags) };
            flags as u64
        });
        __bindgen_bitfield_unit.set(48usize, 16u8, {
            let n_pkts: u32 = unsafe { ::std::mem::transmute(n_pkts) };
            n_pkts as u64
        });
        __bindgen_bitfield_unit.set(64usize, 8u8, {
            let ps_flags: u32 = unsafe { ::std::mem::transmute(ps_flags) };
            ps_flags as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_event__bindgen_ty_10 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub data: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_ef_event__bindgen_ty_10() {
    assert_eq!(
        ::std::mem::size_of::<ef_event__bindgen_ty_10>(),
        8usize,
        concat!("Size of: ", stringify!(ef_event__bindgen_ty_10))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_event__bindgen_ty_10>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_event__bindgen_ty_10))
    );
    fn test_field_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_event__bindgen_ty_10>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_event__bindgen_ty_10),
                "::",
                stringify!(data)
            )
        );
    }
    test_field_data();
}
impl ef_event__bindgen_ty_10 {
    #[inline]
    pub fn type_(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(type_: ::std::os::raw::c_uint) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct ef_event__bindgen_ty_11 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[test]
fn bindgen_test_layout_ef_event__bindgen_ty_11() {
    assert_eq!(
        ::std::mem::size_of::<ef_event__bindgen_ty_11>(),
        8usize,
        concat!("Size of: ", stringify!(ef_event__bindgen_ty_11))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_event__bindgen_ty_11>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_event__bindgen_ty_11))
    );
}
impl ef_event__bindgen_ty_11 {
    #[inline]
    pub fn type_(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn q_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_q_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn __reserved(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set___reserved(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn n_descs(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_n_descs(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn flags(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(48usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_flags(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(48usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: ::std::os::raw::c_uint,
        q_id: ::std::os::raw::c_uint,
        __reserved: ::std::os::raw::c_uint,
        n_descs: ::std::os::raw::c_uint,
        flags: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let q_id: u32 = unsafe { ::std::mem::transmute(q_id) };
            q_id as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let __reserved: u32 = unsafe { ::std::mem::transmute(__reserved) };
            __reserved as u64
        });
        __bindgen_bitfield_unit.set(32usize, 16u8, {
            let n_descs: u32 = unsafe { ::std::mem::transmute(n_descs) };
            n_descs as u64
        });
        __bindgen_bitfield_unit.set(48usize, 16u8, {
            let flags: u32 = unsafe { ::std::mem::transmute(flags) };
            flags as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct ef_event__bindgen_ty_12 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 10usize]>,
    pub __bindgen_padding_0: u16,
}
#[test]
fn bindgen_test_layout_ef_event__bindgen_ty_12() {
    assert_eq!(
        ::std::mem::size_of::<ef_event__bindgen_ty_12>(),
        12usize,
        concat!("Size of: ", stringify!(ef_event__bindgen_ty_12))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_event__bindgen_ty_12>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_event__bindgen_ty_12))
    );
}
impl ef_event__bindgen_ty_12 {
    #[inline]
    pub fn type_(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn q_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_q_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn __reserved(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set___reserved(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn n_descs(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_n_descs(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn flags(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(48usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_flags(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(48usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn subtype(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(64usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_subtype(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(64usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: ::std::os::raw::c_uint,
        q_id: ::std::os::raw::c_uint,
        __reserved: ::std::os::raw::c_uint,
        n_descs: ::std::os::raw::c_uint,
        flags: ::std::os::raw::c_uint,
        subtype: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 10usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 10usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let q_id: u32 = unsafe { ::std::mem::transmute(q_id) };
            q_id as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let __reserved: u32 = unsafe { ::std::mem::transmute(__reserved) };
            __reserved as u64
        });
        __bindgen_bitfield_unit.set(32usize, 16u8, {
            let n_descs: u32 = unsafe { ::std::mem::transmute(n_descs) };
            n_descs as u64
        });
        __bindgen_bitfield_unit.set(48usize, 16u8, {
            let flags: u32 = unsafe { ::std::mem::transmute(flags) };
            flags as u64
        });
        __bindgen_bitfield_unit.set(64usize, 16u8, {
            let subtype: u32 = unsafe { ::std::mem::transmute(subtype) };
            subtype as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct ef_event__bindgen_ty_13 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[test]
fn bindgen_test_layout_ef_event__bindgen_ty_13() {
    assert_eq!(
        ::std::mem::size_of::<ef_event__bindgen_ty_13>(),
        8usize,
        concat!("Size of: ", stringify!(ef_event__bindgen_ty_13))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_event__bindgen_ty_13>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_event__bindgen_ty_13))
    );
}
impl ef_event__bindgen_ty_13 {
    #[inline]
    pub fn type_(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn q_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_q_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn __reserved(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set___reserved(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn n_pkts(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_n_pkts(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn flags(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(48usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_flags(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(48usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: ::std::os::raw::c_uint,
        q_id: ::std::os::raw::c_uint,
        __reserved: ::std::os::raw::c_uint,
        n_pkts: ::std::os::raw::c_uint,
        flags: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let q_id: u32 = unsafe { ::std::mem::transmute(q_id) };
            q_id as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let __reserved: u32 = unsafe { ::std::mem::transmute(__reserved) };
            __reserved as u64
        });
        __bindgen_bitfield_unit.set(32usize, 16u8, {
            let n_pkts: u32 = unsafe { ::std::mem::transmute(n_pkts) };
            n_pkts as u64
        });
        __bindgen_bitfield_unit.set(48usize, 16u8, {
            let flags: u32 = unsafe { ::std::mem::transmute(flags) };
            flags as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct ef_event__bindgen_ty_14 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[test]
fn bindgen_test_layout_ef_event__bindgen_ty_14() {
    assert_eq!(
        ::std::mem::size_of::<ef_event__bindgen_ty_14>(),
        8usize,
        concat!("Size of: ", stringify!(ef_event__bindgen_ty_14))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_event__bindgen_ty_14>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_event__bindgen_ty_14))
    );
}
impl ef_event__bindgen_ty_14 {
    #[inline]
    pub fn type_(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn __reserved(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set___reserved(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn dma_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 32u8) as u32) }
    }
    #[inline]
    pub fn set_dma_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: ::std::os::raw::c_uint,
        __reserved: ::std::os::raw::c_uint,
        dma_id: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let __reserved: u32 = unsafe { ::std::mem::transmute(__reserved) };
            __reserved as u64
        });
        __bindgen_bitfield_unit.set(32usize, 32u8, {
            let dma_id: u32 = unsafe { ::std::mem::transmute(dma_id) };
            dma_id as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct ef_event__bindgen_ty_15 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 12usize]>,
}
#[test]
fn bindgen_test_layout_ef_event__bindgen_ty_15() {
    assert_eq!(
        ::std::mem::size_of::<ef_event__bindgen_ty_15>(),
        12usize,
        concat!("Size of: ", stringify!(ef_event__bindgen_ty_15))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_event__bindgen_ty_15>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_event__bindgen_ty_15))
    );
}
impl ef_event__bindgen_ty_15 {
    #[inline]
    pub fn type_(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn len(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_len(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn pkt_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 32u8) as u32) }
    }
    #[inline]
    pub fn set_pkt_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub fn q_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(64usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_q_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(64usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn user(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(72usize, 24u8) as u32) }
    }
    #[inline]
    pub fn set_user(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(72usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: ::std::os::raw::c_uint,
        len: ::std::os::raw::c_uint,
        pkt_id: ::std::os::raw::c_uint,
        q_id: ::std::os::raw::c_uint,
        user: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 12usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 12usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let len: u32 = unsafe { ::std::mem::transmute(len) };
            len as u64
        });
        __bindgen_bitfield_unit.set(32usize, 32u8, {
            let pkt_id: u32 = unsafe { ::std::mem::transmute(pkt_id) };
            pkt_id as u64
        });
        __bindgen_bitfield_unit.set(64usize, 8u8, {
            let q_id: u32 = unsafe { ::std::mem::transmute(q_id) };
            q_id as u64
        });
        __bindgen_bitfield_unit.set(72usize, 24u8, {
            let user: u32 = unsafe { ::std::mem::transmute(user) };
            user as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct ef_event__bindgen_ty_16 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 14usize]>,
}
#[test]
fn bindgen_test_layout_ef_event__bindgen_ty_16() {
    assert_eq!(
        ::std::mem::size_of::<ef_event__bindgen_ty_16>(),
        16usize,
        concat!("Size of: ", stringify!(ef_event__bindgen_ty_16))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_event__bindgen_ty_16>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_event__bindgen_ty_16))
    );
}
impl ef_event__bindgen_ty_16 {
    #[inline]
    pub fn type_(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn len(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_len(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn pkt_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 32u8) as u32) }
    }
    #[inline]
    pub fn set_pkt_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub fn q_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(64usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_q_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(64usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn user(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(72usize, 24u8) as u32) }
    }
    #[inline]
    pub fn set_user(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(72usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub fn flags(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(96usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_flags(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(96usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: ::std::os::raw::c_uint,
        len: ::std::os::raw::c_uint,
        pkt_id: ::std::os::raw::c_uint,
        q_id: ::std::os::raw::c_uint,
        user: ::std::os::raw::c_uint,
        flags: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 14usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 14usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let len: u32 = unsafe { ::std::mem::transmute(len) };
            len as u64
        });
        __bindgen_bitfield_unit.set(32usize, 32u8, {
            let pkt_id: u32 = unsafe { ::std::mem::transmute(pkt_id) };
            pkt_id as u64
        });
        __bindgen_bitfield_unit.set(64usize, 8u8, {
            let q_id: u32 = unsafe { ::std::mem::transmute(q_id) };
            q_id as u64
        });
        __bindgen_bitfield_unit.set(72usize, 24u8, {
            let user: u32 = unsafe { ::std::mem::transmute(user) };
            user as u64
        });
        __bindgen_bitfield_unit.set(96usize, 16u8, {
            let flags: u32 = unsafe { ::std::mem::transmute(flags) };
            flags as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_ef_event() {
    assert_eq!(
        ::std::mem::size_of::<ef_event>(),
        16usize,
        concat!("Size of: ", stringify!(ef_event))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_event>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_event))
    );
    fn test_field_generic() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_event>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).generic) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_event),
                "::",
                stringify!(generic)
            )
        );
    }
    test_field_generic();
    fn test_field_rx() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_event>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rx) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_event),
                "::",
                stringify!(rx)
            )
        );
    }
    test_field_rx();
    fn test_field_rx_discard() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_event>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rx_discard) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_event),
                "::",
                stringify!(rx_discard)
            )
        );
    }
    test_field_rx_discard();
    fn test_field_tx() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_event>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tx) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_event),
                "::",
                stringify!(tx)
            )
        );
    }
    test_field_tx();
    fn test_field_tx_error() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_event>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tx_error) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_event),
                "::",
                stringify!(tx_error)
            )
        );
    }
    test_field_tx_error();
    fn test_field_tx_timestamp() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_event>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tx_timestamp) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_event),
                "::",
                stringify!(tx_timestamp)
            )
        );
    }
    test_field_tx_timestamp();
    fn test_field_tx_alt() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_event>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tx_alt) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_event),
                "::",
                stringify!(tx_alt)
            )
        );
    }
    test_field_tx_alt();
    fn test_field_rx_no_desc_trunc() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_event>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rx_no_desc_trunc) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_event),
                "::",
                stringify!(rx_no_desc_trunc)
            )
        );
    }
    test_field_rx_no_desc_trunc();
    fn test_field_rx_packed_stream() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_event>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rx_packed_stream) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_event),
                "::",
                stringify!(rx_packed_stream)
            )
        );
    }
    test_field_rx_packed_stream();
    fn test_field_sw() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_event>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sw) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_event),
                "::",
                stringify!(sw)
            )
        );
    }
    test_field_sw();
    fn test_field_rx_multi() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_event>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rx_multi) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_event),
                "::",
                stringify!(rx_multi)
            )
        );
    }
    test_field_rx_multi();
    fn test_field_rx_multi_discard() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_event>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rx_multi_discard) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_event),
                "::",
                stringify!(rx_multi_discard)
            )
        );
    }
    test_field_rx_multi_discard();
    fn test_field_rx_multi_pkts() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_event>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rx_multi_pkts) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_event),
                "::",
                stringify!(rx_multi_pkts)
            )
        );
    }
    test_field_rx_multi_pkts();
    fn test_field_memcpy() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_event>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).memcpy) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_event),
                "::",
                stringify!(memcpy)
            )
        );
    }
    test_field_memcpy();
    fn test_field_rx_ref() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_event>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rx_ref) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_event),
                "::",
                stringify!(rx_ref)
            )
        );
    }
    test_field_rx_ref();
    fn test_field_rx_ref_discard() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_event>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rx_ref_discard) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_event),
                "::",
                stringify!(rx_ref_discard)
            )
        );
    }
    test_field_rx_ref_discard();
}
pub const EF_EVENT_TYPE_RX: _bindgen_ty_1 = 0;
pub const EF_EVENT_TYPE_TX: _bindgen_ty_1 = 1;
pub const EF_EVENT_TYPE_RX_DISCARD: _bindgen_ty_1 = 2;
pub const EF_EVENT_TYPE_TX_ERROR: _bindgen_ty_1 = 3;
pub const EF_EVENT_TYPE_RX_NO_DESC_TRUNC: _bindgen_ty_1 = 4;
pub const EF_EVENT_TYPE_SW: _bindgen_ty_1 = 5;
pub const EF_EVENT_TYPE_OFLOW: _bindgen_ty_1 = 6;
pub const EF_EVENT_TYPE_TX_WITH_TIMESTAMP: _bindgen_ty_1 = 7;
pub const EF_EVENT_TYPE_RX_PACKED_STREAM: _bindgen_ty_1 = 8;
pub const EF_EVENT_TYPE_RX_MULTI: _bindgen_ty_1 = 9;
pub const EF_EVENT_TYPE_TX_ALT: _bindgen_ty_1 = 10;
pub const EF_EVENT_TYPE_RX_MULTI_DISCARD: _bindgen_ty_1 = 11;
pub const EF_EVENT_TYPE_RESET: _bindgen_ty_1 = 12;
pub const EF_EVENT_TYPE_MEMCPY: _bindgen_ty_1 = 13;
pub const EF_EVENT_TYPE_RX_MULTI_PKTS: _bindgen_ty_1 = 14;
pub const EF_EVENT_TYPE_RX_REF: _bindgen_ty_1 = 15;
pub const EF_EVENT_TYPE_RX_REF_DISCARD: _bindgen_ty_1 = 16;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
pub const EF_EVENT_RX_DISCARD_CSUM_BAD: _bindgen_ty_2 = 0;
pub const EF_EVENT_RX_DISCARD_MCAST_MISMATCH: _bindgen_ty_2 = 1;
pub const EF_EVENT_RX_DISCARD_CRC_BAD: _bindgen_ty_2 = 2;
pub const EF_EVENT_RX_DISCARD_TRUNC: _bindgen_ty_2 = 3;
pub const EF_EVENT_RX_DISCARD_RIGHTS: _bindgen_ty_2 = 4;
pub const EF_EVENT_RX_DISCARD_EV_ERROR: _bindgen_ty_2 = 5;
pub const EF_EVENT_RX_DISCARD_OTHER: _bindgen_ty_2 = 6;
pub const EF_EVENT_RX_DISCARD_INNER_CSUM_BAD: _bindgen_ty_2 = 7;
pub const EF_EVENT_RX_DISCARD_MAX: _bindgen_ty_2 = 8;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
pub const EF_EVENT_TX_ERROR_RIGHTS: _bindgen_ty_3 = 0;
pub const EF_EVENT_TX_ERROR_OFLOW: _bindgen_ty_3 = 1;
pub const EF_EVENT_TX_ERROR_2BIG: _bindgen_ty_3 = 2;
pub const EF_EVENT_TX_ERROR_BUS: _bindgen_ty_3 = 3;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_iovec {
    pub iov_base: ef_addr,
    pub iov_len: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_ef_iovec() {
    assert_eq!(
        ::std::mem::size_of::<ef_iovec>(),
        16usize,
        concat!("Size of: ", stringify!(ef_iovec))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_iovec>(),
        8usize,
        concat!("Alignment of ", stringify!(ef_iovec))
    );
    fn test_field_iov_base() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_iovec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).iov_base) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_iovec),
                "::",
                stringify!(iov_base)
            )
        );
    }
    test_field_iov_base();
    fn test_field_iov_len() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_iovec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).iov_len) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_iovec),
                "::",
                stringify!(iov_len)
            )
        );
    }
    test_field_iov_len();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_remote_iovec {
    pub iov_base: ef_addr,
    pub iov_len: ::std::os::raw::c_uint,
    pub flags: u32,
    pub addrspace: ef_addrspace,
}
#[test]
fn bindgen_test_layout_ef_remote_iovec() {
    assert_eq!(
        ::std::mem::size_of::<ef_remote_iovec>(),
        24usize,
        concat!("Size of: ", stringify!(ef_remote_iovec))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_remote_iovec>(),
        8usize,
        concat!("Alignment of ", stringify!(ef_remote_iovec))
    );
    fn test_field_iov_base() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_remote_iovec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).iov_base) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_remote_iovec),
                "::",
                stringify!(iov_base)
            )
        );
    }
    test_field_iov_base();
    fn test_field_iov_len() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_remote_iovec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).iov_len) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_remote_iovec),
                "::",
                stringify!(iov_len)
            )
        );
    }
    test_field_iov_len();
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_remote_iovec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_remote_iovec),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
    fn test_field_addrspace() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_remote_iovec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).addrspace) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_remote_iovec),
                "::",
                stringify!(addrspace)
            )
        );
    }
    test_field_addrspace();
}
pub const ef_vi_flags_EF_VI_FLAGS_DEFAULT: ef_vi_flags = 0;
pub const ef_vi_flags_EF_VI_ISCSI_RX_HDIG: ef_vi_flags = 2;
pub const ef_vi_flags_EF_VI_ISCSI_TX_HDIG: ef_vi_flags = 4;
pub const ef_vi_flags_EF_VI_ISCSI_RX_DDIG: ef_vi_flags = 8;
pub const ef_vi_flags_EF_VI_ISCSI_TX_DDIG: ef_vi_flags = 16;
pub const ef_vi_flags_EF_VI_TX_PHYS_ADDR: ef_vi_flags = 32;
pub const ef_vi_flags_EF_VI_RX_PHYS_ADDR: ef_vi_flags = 64;
pub const ef_vi_flags_EF_VI_TX_IP_CSUM_DIS: ef_vi_flags = 128;
pub const ef_vi_flags_EF_VI_TX_TCPUDP_CSUM_DIS: ef_vi_flags = 256;
pub const ef_vi_flags_EF_VI_TX_TCPUDP_ONLY: ef_vi_flags = 512;
pub const ef_vi_flags_EF_VI_TX_FILTER_IP: ef_vi_flags = 1024;
pub const ef_vi_flags_EF_VI_TX_FILTER_MAC: ef_vi_flags = 2048;
pub const ef_vi_flags_EF_VI_TX_FILTER_MASK_1: ef_vi_flags = 4096;
pub const ef_vi_flags_EF_VI_TX_FILTER_MASK_2: ef_vi_flags = 8192;
pub const ef_vi_flags_EF_VI_TX_FILTER_MASK_3: ef_vi_flags = 12288;
pub const ef_vi_flags_EF_VI_TX_PUSH_DISABLE: ef_vi_flags = 16384;
pub const ef_vi_flags_EF_VI_TX_PUSH_ALWAYS: ef_vi_flags = 32768;
pub const ef_vi_flags_EF_VI_RX_TIMESTAMPS: ef_vi_flags = 65536;
pub const ef_vi_flags_EF_VI_TX_TIMESTAMPS: ef_vi_flags = 131072;
pub const ef_vi_flags_EF_VI_RX_PACKED_STREAM: ef_vi_flags = 524288;
pub const ef_vi_flags_EF_VI_RX_PS_BUF_SIZE_64K: ef_vi_flags = 1048576;
pub const ef_vi_flags_EF_VI_RX_EVENT_MERGE: ef_vi_flags = 2097152;
pub const ef_vi_flags_EF_VI_TX_ALT: ef_vi_flags = 4194304;
pub const ef_vi_flags_EF_VI_ENABLE_EV_TIMER: ef_vi_flags = 8388608;
pub const ef_vi_flags_EF_VI_TX_CTPIO: ef_vi_flags = 16777216;
pub const ef_vi_flags_EF_VI_TX_CTPIO_NO_POISON: ef_vi_flags = 33554432;
pub const ef_vi_flags_EF_VI_RX_ZEROCOPY: ef_vi_flags = 67108864;
pub const ef_vi_flags_EF_VI_ALLOW_MEMCPY: ef_vi_flags = 134217728;
pub const ef_vi_flags_EF_VI_EFCT_UNIQUEUE: ef_vi_flags = 268435456;
pub const ef_vi_flags_EF_VI_RX_EXCLUSIVE: ef_vi_flags = 536870912;
pub type ef_vi_flags = ::std::os::raw::c_uint;
pub const ef_vi_out_flags_EF_VI_OUT_CLOCK_SYNC_STATUS: ef_vi_out_flags = 1;
pub type ef_vi_out_flags = ::std::os::raw::c_uint;
pub const ef_vi_rx_discard_err_flags_EF_VI_DISCARD_RX_L4_CSUM_ERR: ef_vi_rx_discard_err_flags = 1;
pub const ef_vi_rx_discard_err_flags_EF_VI_DISCARD_RX_L3_CSUM_ERR: ef_vi_rx_discard_err_flags = 2;
pub const ef_vi_rx_discard_err_flags_EF_VI_DISCARD_RX_ETH_FCS_ERR: ef_vi_rx_discard_err_flags = 4;
pub const ef_vi_rx_discard_err_flags_EF_VI_DISCARD_RX_ETH_LEN_ERR: ef_vi_rx_discard_err_flags = 8;
pub const ef_vi_rx_discard_err_flags_EF_VI_DISCARD_RX_TOBE_DISC: ef_vi_rx_discard_err_flags = 16;
pub const ef_vi_rx_discard_err_flags_EF_VI_DISCARD_RX_INNER_L4_CSUM_ERR:
    ef_vi_rx_discard_err_flags = 32;
pub const ef_vi_rx_discard_err_flags_EF_VI_DISCARD_RX_INNER_L3_CSUM_ERR:
    ef_vi_rx_discard_err_flags = 64;
pub const ef_vi_rx_discard_err_flags_EF_VI_DISCARD_RX_L2_CLASS_OTHER: ef_vi_rx_discard_err_flags =
    128;
pub const ef_vi_rx_discard_err_flags_EF_VI_DISCARD_RX_L3_CLASS_OTHER: ef_vi_rx_discard_err_flags =
    256;
pub const ef_vi_rx_discard_err_flags_EF_VI_DISCARD_RX_L4_CLASS_OTHER: ef_vi_rx_discard_err_flags =
    512;
pub type ef_vi_rx_discard_err_flags = ::std::os::raw::c_uint;
pub const ef_timestamp_format_TS_FORMAT_SECONDS_27FRACTION: ef_timestamp_format = 0;
pub const ef_timestamp_format_TS_FORMAT_SECONDS_QTR_NANOSECONDS: ef_timestamp_format = 1;
pub type ef_timestamp_format = ::std::os::raw::c_uint;
pub const ef_vi_arch_EF_VI_ARCH_FALCON: ef_vi_arch = 0;
pub const ef_vi_arch_EF_VI_ARCH_EF10: ef_vi_arch = 1;
pub const ef_vi_arch_EF_VI_ARCH_EF100: ef_vi_arch = 2;
pub const ef_vi_arch_EF_VI_ARCH_EFCT: ef_vi_arch = 3;
pub const ef_vi_arch_EF_VI_ARCH_AF_XDP: ef_vi_arch = 4;
pub type ef_vi_arch = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_vi_txq_state {
    pub previous: u32,
    pub added: u32,
    pub removed: u32,
    pub ct_added: u32,
    pub ct_removed: u32,
    pub ts_nsec: u32,
}
#[test]
fn bindgen_test_layout_ef_vi_txq_state() {
    assert_eq!(
        ::std::mem::size_of::<ef_vi_txq_state>(),
        24usize,
        concat!("Size of: ", stringify!(ef_vi_txq_state))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_vi_txq_state>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_vi_txq_state))
    );
    fn test_field_previous() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_txq_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).previous) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_txq_state),
                "::",
                stringify!(previous)
            )
        );
    }
    test_field_previous();
    fn test_field_added() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_txq_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).added) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_txq_state),
                "::",
                stringify!(added)
            )
        );
    }
    test_field_added();
    fn test_field_removed() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_txq_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).removed) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_txq_state),
                "::",
                stringify!(removed)
            )
        );
    }
    test_field_removed();
    fn test_field_ct_added() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_txq_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ct_added) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_txq_state),
                "::",
                stringify!(ct_added)
            )
        );
    }
    test_field_ct_added();
    fn test_field_ct_removed() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_txq_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ct_removed) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_txq_state),
                "::",
                stringify!(ct_removed)
            )
        );
    }
    test_field_ct_removed();
    fn test_field_ts_nsec() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_txq_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ts_nsec) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_txq_state),
                "::",
                stringify!(ts_nsec)
            )
        );
    }
    test_field_ts_nsec();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_vi_efct_rxq_ptr {
    pub prev: u32,
    pub next: u64,
}
#[test]
fn bindgen_test_layout_ef_vi_efct_rxq_ptr() {
    assert_eq!(
        ::std::mem::size_of::<ef_vi_efct_rxq_ptr>(),
        16usize,
        concat!("Size of: ", stringify!(ef_vi_efct_rxq_ptr))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_vi_efct_rxq_ptr>(),
        8usize,
        concat!("Alignment of ", stringify!(ef_vi_efct_rxq_ptr))
    );
    fn test_field_prev() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_efct_rxq_ptr>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_efct_rxq_ptr),
                "::",
                stringify!(prev)
            )
        );
    }
    test_field_prev();
    fn test_field_next() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_efct_rxq_ptr>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_efct_rxq_ptr),
                "::",
                stringify!(next)
            )
        );
    }
    test_field_next();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_vi_rxq_state {
    pub posted: u32,
    pub added: u32,
    pub removed: u32,
    pub in_jumbo: u32,
    pub bytes_acc: u32,
    pub last_desc_i: u16,
    pub rx_ps_credit_avail: u16,
    pub rxq_ptr: [ef_vi_efct_rxq_ptr; 8usize],
}
#[test]
fn bindgen_test_layout_ef_vi_rxq_state() {
    assert_eq!(
        ::std::mem::size_of::<ef_vi_rxq_state>(),
        152usize,
        concat!("Size of: ", stringify!(ef_vi_rxq_state))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_vi_rxq_state>(),
        8usize,
        concat!("Alignment of ", stringify!(ef_vi_rxq_state))
    );
    fn test_field_posted() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_rxq_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).posted) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_rxq_state),
                "::",
                stringify!(posted)
            )
        );
    }
    test_field_posted();
    fn test_field_added() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_rxq_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).added) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_rxq_state),
                "::",
                stringify!(added)
            )
        );
    }
    test_field_added();
    fn test_field_removed() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_rxq_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).removed) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_rxq_state),
                "::",
                stringify!(removed)
            )
        );
    }
    test_field_removed();
    fn test_field_in_jumbo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_rxq_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).in_jumbo) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_rxq_state),
                "::",
                stringify!(in_jumbo)
            )
        );
    }
    test_field_in_jumbo();
    fn test_field_bytes_acc() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_rxq_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bytes_acc) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_rxq_state),
                "::",
                stringify!(bytes_acc)
            )
        );
    }
    test_field_bytes_acc();
    fn test_field_last_desc_i() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_rxq_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).last_desc_i) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_rxq_state),
                "::",
                stringify!(last_desc_i)
            )
        );
    }
    test_field_last_desc_i();
    fn test_field_rx_ps_credit_avail() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_rxq_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rx_ps_credit_avail) as usize - ptr as usize
            },
            22usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_rxq_state),
                "::",
                stringify!(rx_ps_credit_avail)
            )
        );
    }
    test_field_rx_ps_credit_avail();
    fn test_field_rxq_ptr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_rxq_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rxq_ptr) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_rxq_state),
                "::",
                stringify!(rxq_ptr)
            )
        );
    }
    test_field_rxq_ptr();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_eventq_state {
    pub evq_ptr: ef_eventq_ptr,
    pub evq_clear_stride: i32,
    pub sync_timestamp_major: u32,
    pub sync_timestamp_minor: u32,
    pub sync_timestamp_minimum: u32,
    pub sync_timestamp_synchronised: u32,
    pub unsol_credit_seq: u32,
    pub sync_flags: u32,
}
#[test]
fn bindgen_test_layout_ef_eventq_state() {
    assert_eq!(
        ::std::mem::size_of::<ef_eventq_state>(),
        32usize,
        concat!("Size of: ", stringify!(ef_eventq_state))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_eventq_state>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_eventq_state))
    );
    fn test_field_evq_ptr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_eventq_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).evq_ptr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_eventq_state),
                "::",
                stringify!(evq_ptr)
            )
        );
    }
    test_field_evq_ptr();
    fn test_field_evq_clear_stride() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_eventq_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).evq_clear_stride) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_eventq_state),
                "::",
                stringify!(evq_clear_stride)
            )
        );
    }
    test_field_evq_clear_stride();
    fn test_field_sync_timestamp_major() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_eventq_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sync_timestamp_major) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_eventq_state),
                "::",
                stringify!(sync_timestamp_major)
            )
        );
    }
    test_field_sync_timestamp_major();
    fn test_field_sync_timestamp_minor() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_eventq_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sync_timestamp_minor) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_eventq_state),
                "::",
                stringify!(sync_timestamp_minor)
            )
        );
    }
    test_field_sync_timestamp_minor();
    fn test_field_sync_timestamp_minimum() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_eventq_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sync_timestamp_minimum) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_eventq_state),
                "::",
                stringify!(sync_timestamp_minimum)
            )
        );
    }
    test_field_sync_timestamp_minimum();
    fn test_field_sync_timestamp_synchronised() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_eventq_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sync_timestamp_synchronised) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_eventq_state),
                "::",
                stringify!(sync_timestamp_synchronised)
            )
        );
    }
    test_field_sync_timestamp_synchronised();
    fn test_field_unsol_credit_seq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_eventq_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unsol_credit_seq) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_eventq_state),
                "::",
                stringify!(unsol_credit_seq)
            )
        );
    }
    test_field_unsol_credit_seq();
    fn test_field_sync_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_eventq_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sync_flags) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_eventq_state),
                "::",
                stringify!(sync_flags)
            )
        );
    }
    test_field_sync_flags();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_vi_txq {
    pub mask: u32,
    pub ct_fifo_bytes: u32,
    pub descriptors: *mut ::std::os::raw::c_void,
    pub ids: *mut u32,
}
#[test]
fn bindgen_test_layout_ef_vi_txq() {
    assert_eq!(
        ::std::mem::size_of::<ef_vi_txq>(),
        24usize,
        concat!("Size of: ", stringify!(ef_vi_txq))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_vi_txq>(),
        8usize,
        concat!("Alignment of ", stringify!(ef_vi_txq))
    );
    fn test_field_mask() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_txq>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mask) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_txq),
                "::",
                stringify!(mask)
            )
        );
    }
    test_field_mask();
    fn test_field_ct_fifo_bytes() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_txq>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ct_fifo_bytes) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_txq),
                "::",
                stringify!(ct_fifo_bytes)
            )
        );
    }
    test_field_ct_fifo_bytes();
    fn test_field_descriptors() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_txq>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).descriptors) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_txq),
                "::",
                stringify!(descriptors)
            )
        );
    }
    test_field_descriptors();
    fn test_field_ids() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_txq>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ids) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_txq),
                "::",
                stringify!(ids)
            )
        );
    }
    test_field_ids();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_vi_rxq {
    pub mask: u32,
    pub descriptors: *mut ::std::os::raw::c_void,
    pub ids: *mut u32,
}
#[test]
fn bindgen_test_layout_ef_vi_rxq() {
    assert_eq!(
        ::std::mem::size_of::<ef_vi_rxq>(),
        24usize,
        concat!("Size of: ", stringify!(ef_vi_rxq))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_vi_rxq>(),
        8usize,
        concat!("Alignment of ", stringify!(ef_vi_rxq))
    );
    fn test_field_mask() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_rxq>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mask) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_rxq),
                "::",
                stringify!(mask)
            )
        );
    }
    test_field_mask();
    fn test_field_descriptors() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_rxq>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).descriptors) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_rxq),
                "::",
                stringify!(descriptors)
            )
        );
    }
    test_field_descriptors();
    fn test_field_ids() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_rxq>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ids) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_rxq),
                "::",
                stringify!(ids)
            )
        );
    }
    test_field_ids();
}
pub type ef_vi_efct_superbuf_refresh_t = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut ef_vi, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_vi_efct_rxq {
    pub resource_id: ::std::os::raw::c_uint,
    pub superbuf: *const ::std::os::raw::c_char,
    pub current_mappings: *mut u64,
    pub config_generation: u32,
    pub refresh_func: ef_vi_efct_superbuf_refresh_t,
}
#[test]
fn bindgen_test_layout_ef_vi_efct_rxq() {
    assert_eq!(
        ::std::mem::size_of::<ef_vi_efct_rxq>(),
        40usize,
        concat!("Size of: ", stringify!(ef_vi_efct_rxq))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_vi_efct_rxq>(),
        8usize,
        concat!("Alignment of ", stringify!(ef_vi_efct_rxq))
    );
    fn test_field_resource_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_efct_rxq>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).resource_id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_efct_rxq),
                "::",
                stringify!(resource_id)
            )
        );
    }
    test_field_resource_id();
    fn test_field_superbuf() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_efct_rxq>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).superbuf) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_efct_rxq),
                "::",
                stringify!(superbuf)
            )
        );
    }
    test_field_superbuf();
    fn test_field_current_mappings() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_efct_rxq>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).current_mappings) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_efct_rxq),
                "::",
                stringify!(current_mappings)
            )
        );
    }
    test_field_current_mappings();
    fn test_field_config_generation() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_efct_rxq>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).config_generation) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_efct_rxq),
                "::",
                stringify!(config_generation)
            )
        );
    }
    test_field_config_generation();
    fn test_field_refresh_func() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_efct_rxq>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).refresh_func) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_efct_rxq),
                "::",
                stringify!(refresh_func)
            )
        );
    }
    test_field_refresh_func();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_vi_state {
    pub evq: ef_eventq_state,
    pub txq: ef_vi_txq_state,
    pub rxq: ef_vi_rxq_state,
}
#[test]
fn bindgen_test_layout_ef_vi_state() {
    assert_eq!(
        ::std::mem::size_of::<ef_vi_state>(),
        208usize,
        concat!("Size of: ", stringify!(ef_vi_state))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_vi_state>(),
        8usize,
        concat!("Alignment of ", stringify!(ef_vi_state))
    );
    fn test_field_evq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).evq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_state),
                "::",
                stringify!(evq)
            )
        );
    }
    test_field_evq();
    fn test_field_txq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).txq) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_state),
                "::",
                stringify!(txq)
            )
        );
    }
    test_field_txq();
    fn test_field_rxq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_state>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rxq) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_state),
                "::",
                stringify!(rxq)
            )
        );
    }
    test_field_rxq();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_vi_stats {
    pub rx_ev_lost: u32,
    pub rx_ev_bad_desc_i: u32,
    pub rx_ev_bad_q_label: u32,
    pub evq_gap: u32,
}
#[test]
fn bindgen_test_layout_ef_vi_stats() {
    assert_eq!(
        ::std::mem::size_of::<ef_vi_stats>(),
        16usize,
        concat!("Size of: ", stringify!(ef_vi_stats))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_vi_stats>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_vi_stats))
    );
    fn test_field_rx_ev_lost() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_stats>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rx_ev_lost) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_stats),
                "::",
                stringify!(rx_ev_lost)
            )
        );
    }
    test_field_rx_ev_lost();
    fn test_field_rx_ev_bad_desc_i() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_stats>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rx_ev_bad_desc_i) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_stats),
                "::",
                stringify!(rx_ev_bad_desc_i)
            )
        );
    }
    test_field_rx_ev_bad_desc_i();
    fn test_field_rx_ev_bad_q_label() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_stats>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rx_ev_bad_q_label) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_stats),
                "::",
                stringify!(rx_ev_bad_q_label)
            )
        );
    }
    test_field_rx_ev_bad_q_label();
    fn test_field_evq_gap() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_stats>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).evq_gap) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_stats),
                "::",
                stringify!(evq_gap)
            )
        );
    }
    test_field_evq_gap();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_vi_nic_type {
    pub arch: ::std::os::raw::c_uchar,
    pub variant: ::std::os::raw::c_char,
    pub revision: ::std::os::raw::c_uchar,
    pub nic_flags: ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_ef_vi_nic_type() {
    assert_eq!(
        ::std::mem::size_of::<ef_vi_nic_type>(),
        4usize,
        concat!("Size of: ", stringify!(ef_vi_nic_type))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_vi_nic_type>(),
        1usize,
        concat!("Alignment of ", stringify!(ef_vi_nic_type))
    );
    fn test_field_arch() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_nic_type>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).arch) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_nic_type),
                "::",
                stringify!(arch)
            )
        );
    }
    test_field_arch();
    fn test_field_variant() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_nic_type>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).variant) as usize - ptr as usize
            },
            1usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_nic_type),
                "::",
                stringify!(variant)
            )
        );
    }
    test_field_variant();
    fn test_field_revision() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_nic_type>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).revision) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_nic_type),
                "::",
                stringify!(revision)
            )
        );
    }
    test_field_revision();
    fn test_field_nic_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_nic_type>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nic_flags) as usize - ptr as usize
            },
            3usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_nic_type),
                "::",
                stringify!(nic_flags)
            )
        );
    }
    test_field_nic_flags();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_vi_transmit_alt_overhead {
    pub pre_round: u32,
    pub mask: u32,
    pub post_round: u32,
}
#[test]
fn bindgen_test_layout_ef_vi_transmit_alt_overhead() {
    assert_eq!(
        ::std::mem::size_of::<ef_vi_transmit_alt_overhead>(),
        12usize,
        concat!("Size of: ", stringify!(ef_vi_transmit_alt_overhead))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_vi_transmit_alt_overhead>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_vi_transmit_alt_overhead))
    );
    fn test_field_pre_round() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_transmit_alt_overhead>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pre_round) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_transmit_alt_overhead),
                "::",
                stringify!(pre_round)
            )
        );
    }
    test_field_pre_round();
    fn test_field_mask() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_transmit_alt_overhead>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mask) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_transmit_alt_overhead),
                "::",
                stringify!(mask)
            )
        );
    }
    test_field_mask();
    fn test_field_post_round() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_transmit_alt_overhead>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).post_round) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_transmit_alt_overhead),
                "::",
                stringify!(post_round)
            )
        );
    }
    test_field_post_round();
}
pub const ef_vi_tx_extra_flags_EF_VI_TX_EXTRA_MARK: ef_vi_tx_extra_flags = 1;
pub const ef_vi_tx_extra_flags_EF_VI_TX_EXTRA_INGRESS_MPORT: ef_vi_tx_extra_flags = 2;
pub const ef_vi_tx_extra_flags_EF_VI_TX_EXTRA_EGRESS_MPORT: ef_vi_tx_extra_flags = 4;
pub const ef_vi_tx_extra_flags_EF_VI_TX_EXTRA_CAPSULE_METADATA: ef_vi_tx_extra_flags = 8;
pub type ef_vi_tx_extra_flags = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_vi_tx_extra {
    pub flags: ef_vi_tx_extra_flags,
    pub mark: u32,
    pub ingress_mport: u16,
    pub egress_mport: u16,
}
#[test]
fn bindgen_test_layout_ef_vi_tx_extra() {
    assert_eq!(
        ::std::mem::size_of::<ef_vi_tx_extra>(),
        12usize,
        concat!("Size of: ", stringify!(ef_vi_tx_extra))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_vi_tx_extra>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_vi_tx_extra))
    );
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_tx_extra>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_tx_extra),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
    fn test_field_mark() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_tx_extra>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mark) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_tx_extra),
                "::",
                stringify!(mark)
            )
        );
    }
    test_field_mark();
    fn test_field_ingress_mport() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_tx_extra>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ingress_mport) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_tx_extra),
                "::",
                stringify!(ingress_mport)
            )
        );
    }
    test_field_ingress_mport();
    fn test_field_egress_mport() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_tx_extra>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).egress_mport) as usize - ptr as usize
            },
            10usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_tx_extra),
                "::",
                stringify!(egress_mport)
            )
        );
    }
    test_field_egress_mport();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_vi {
    pub inited: ::std::os::raw::c_uint,
    pub vi_resource_id: ::std::os::raw::c_uint,
    pub vi_i: ::std::os::raw::c_uint,
    pub abs_idx: ::std::os::raw::c_uint,
    pub dh: ef_driver_handle,
    pub rx_buffer_len: ::std::os::raw::c_uint,
    pub rx_prefix_len: ::std::os::raw::c_uint,
    pub last_ctpio_failed: u8,
    pub rx_discard_mask: u64,
    pub rx_ts_correction: ::std::os::raw::c_int,
    pub rx_pkt_len_offset: ::std::os::raw::c_uint,
    pub rx_pkt_len_mask: ::std::os::raw::c_uint,
    pub tx_ts_correction_ns: ::std::os::raw::c_int,
    pub ts_format: ef_timestamp_format,
    pub vi_mem_mmap_ptr: *mut ::std::os::raw::c_char,
    pub vi_mem_mmap_bytes: ::std::os::raw::c_int,
    pub vi_io_mmap_ptr: *mut ::std::os::raw::c_char,
    pub vi_io_mmap_bytes: ::std::os::raw::c_int,
    pub vi_ctpio_mmap_ptr: *mut ::std::os::raw::c_char,
    pub vi_ctpio_wb_ticks: u32,
    pub ep_state_bytes: ::std::os::raw::c_int,
    pub vi_clustered: ::std::os::raw::c_int,
    pub vi_is_packed_stream: ::std::os::raw::c_int,
    pub vi_is_normal: ::std::os::raw::c_int,
    pub vi_ps_buf_size: ::std::os::raw::c_uint,
    pub io: ef_vi_ioaddr_t,
    pub linked_pio: *mut ef_pio,
    pub evq_base: *mut ::std::os::raw::c_char,
    pub evq_mask: ::std::os::raw::c_uint,
    pub evq_phase_bits: ::std::os::raw::c_int,
    pub timer_quantum_ns: ::std::os::raw::c_uint,
    pub tx_push_thresh: ::std::os::raw::c_uint,
    pub vi_txq: ef_vi_txq,
    pub vi_rxq: ef_vi_rxq,
    pub ep_state: *mut ef_vi_state,
    pub vi_flags: ef_vi_flags,
    pub vi_out_flags: ef_vi_out_flags,
    pub vi_stats: *mut ef_vi_stats,
    pub vi_qs: [*mut ef_vi; 32usize],
    pub vi_qs_n: ::std::os::raw::c_int,
    pub future_qid: u8,
    pub efct_rxq: [ef_vi_efct_rxq; 8usize],
    pub efct_shm: *mut efab_efct_rxq_uk_shm_base,
    pub max_efct_rxq: ::std::os::raw::c_int,
    pub tx_alt_num: ::std::os::raw::c_uint,
    pub tx_alt_id2hw: *mut ::std::os::raw::c_uint,
    pub tx_alt_hw2id: *mut ::std::os::raw::c_uint,
    pub nic_type: ef_vi_nic_type,
    pub xdp_kick:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ef_vi) -> ::std::os::raw::c_int>,
    pub xdp_kick_context: *mut ::std::os::raw::c_void,
    pub ops: ef_vi_ops,
    pub internal_ops: ef_vi_internal_ops,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_vi_ops {
    pub transmit: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ef_vi,
            base: ef_addr,
            len: ::std::os::raw::c_int,
            arg2: ef_request_id,
        ) -> ::std::os::raw::c_int,
    >,
    pub transmitv: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ef_vi,
            arg2: *const ef_iovec,
            iov_len: ::std::os::raw::c_int,
            arg3: ef_request_id,
        ) -> ::std::os::raw::c_int,
    >,
    pub transmitv_init: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ef_vi,
            arg2: *const ef_iovec,
            iov_len: ::std::os::raw::c_int,
            arg3: ef_request_id,
        ) -> ::std::os::raw::c_int,
    >,
    pub transmit_push: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ef_vi)>,
    pub transmit_pio: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ef_vi,
            offset: ::std::os::raw::c_int,
            len: ::std::os::raw::c_int,
            dma_id: ef_request_id,
        ) -> ::std::os::raw::c_int,
    >,
    pub transmit_copy_pio: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ef_vi,
            pio_offset: ::std::os::raw::c_int,
            src_buf: *const ::std::os::raw::c_void,
            len: ::std::os::raw::c_int,
            dma_id: ef_request_id,
        ) -> ::std::os::raw::c_int,
    >,
    pub transmit_pio_warm: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ef_vi)>,
    pub transmit_copy_pio_warm: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ef_vi,
            pio_offset: ::std::os::raw::c_int,
            src_buf: *const ::std::os::raw::c_void,
            len: ::std::os::raw::c_int,
        ),
    >,
    pub transmitv_ctpio: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ef_vi,
            frame_len: size_t,
            iov: *const iovec,
            iov_len: ::std::os::raw::c_int,
            threshold: ::std::os::raw::c_uint,
        ),
    >,
    pub transmitv_ctpio_copy: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ef_vi,
            frame_len: size_t,
            iov: *const iovec,
            iov_len: ::std::os::raw::c_int,
            threshold: ::std::os::raw::c_uint,
            fallback: *mut ::std::os::raw::c_void,
        ),
    >,
    pub transmit_alt_select: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ef_vi,
            alt_id: ::std::os::raw::c_uint,
        ) -> ::std::os::raw::c_int,
    >,
    pub transmit_alt_select_default:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ef_vi) -> ::std::os::raw::c_int>,
    pub transmit_alt_stop: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ef_vi,
            alt_id: ::std::os::raw::c_uint,
        ) -> ::std::os::raw::c_int,
    >,
    pub transmit_alt_go: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ef_vi,
            alt_id: ::std::os::raw::c_uint,
        ) -> ::std::os::raw::c_int,
    >,
    pub receive_set_discards: ::std::option::Option<
        unsafe extern "C" fn(
            vi: *mut ef_vi,
            discard_err_flags: ::std::os::raw::c_uint,
        ) -> ::std::os::raw::c_int,
    >,
    pub receive_get_discards: ::std::option::Option<unsafe extern "C" fn(vi: *mut ef_vi) -> u64>,
    pub transmit_alt_discard: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ef_vi,
            alt_id: ::std::os::raw::c_uint,
        ) -> ::std::os::raw::c_int,
    >,
    pub receive_init: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ef_vi,
            arg2: ef_addr,
            arg3: ef_request_id,
        ) -> ::std::os::raw::c_int,
    >,
    pub receive_push: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ef_vi)>,
    pub eventq_poll: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ef_vi,
            arg2: *mut ef_event,
            evs_len: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub eventq_prime: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ef_vi)>,
    pub eventq_timer_prime:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ef_vi, v: ::std::os::raw::c_uint)>,
    pub eventq_timer_run:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ef_vi, v: ::std::os::raw::c_uint)>,
    pub eventq_timer_clear: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ef_vi)>,
    pub eventq_timer_zero: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ef_vi)>,
    pub transmitv_init_extra: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ef_vi,
            arg2: *const ef_vi_tx_extra,
            arg3: *const ef_remote_iovec,
            iov_len: ::std::os::raw::c_int,
            arg4: ef_request_id,
        ) -> ::std::os::raw::c_int,
    >,
    pub transmit_memcpy: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ef_vi,
            dst_iov: *const ef_remote_iovec,
            dst_iov_len: ::std::os::raw::c_int,
            src_iov: *const ef_remote_iovec,
            src_iov_len: ::std::os::raw::c_int,
        ) -> ssize_t,
    >,
    pub transmit_memcpy_sync: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ef_vi, dma_id: ef_request_id) -> ::std::os::raw::c_int,
    >,
    pub transmit_ctpio_fallback: ::std::option::Option<
        unsafe extern "C" fn(
            vi: *mut ef_vi,
            dma_addr: ef_addr,
            len: size_t,
            dma_id: ef_request_id,
        ) -> ::std::os::raw::c_int,
    >,
    pub transmitv_ctpio_fallback: ::std::option::Option<
        unsafe extern "C" fn(
            vi: *mut ef_vi,
            dma_iov: *const ef_iovec,
            dma_iov_len: ::std::os::raw::c_int,
            dma_id: ef_request_id,
        ) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout_ef_vi_ops() {
    assert_eq!(
        ::std::mem::size_of::<ef_vi_ops>(),
        240usize,
        concat!("Size of: ", stringify!(ef_vi_ops))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_vi_ops>(),
        8usize,
        concat!("Alignment of ", stringify!(ef_vi_ops))
    );
    fn test_field_transmit() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transmit) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(transmit)
            )
        );
    }
    test_field_transmit();
    fn test_field_transmitv() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transmitv) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(transmitv)
            )
        );
    }
    test_field_transmitv();
    fn test_field_transmitv_init() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transmitv_init) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(transmitv_init)
            )
        );
    }
    test_field_transmitv_init();
    fn test_field_transmit_push() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transmit_push) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(transmit_push)
            )
        );
    }
    test_field_transmit_push();
    fn test_field_transmit_pio() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transmit_pio) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(transmit_pio)
            )
        );
    }
    test_field_transmit_pio();
    fn test_field_transmit_copy_pio() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transmit_copy_pio) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(transmit_copy_pio)
            )
        );
    }
    test_field_transmit_copy_pio();
    fn test_field_transmit_pio_warm() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transmit_pio_warm) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(transmit_pio_warm)
            )
        );
    }
    test_field_transmit_pio_warm();
    fn test_field_transmit_copy_pio_warm() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transmit_copy_pio_warm) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(transmit_copy_pio_warm)
            )
        );
    }
    test_field_transmit_copy_pio_warm();
    fn test_field_transmitv_ctpio() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transmitv_ctpio) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(transmitv_ctpio)
            )
        );
    }
    test_field_transmitv_ctpio();
    fn test_field_transmitv_ctpio_copy() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transmitv_ctpio_copy) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(transmitv_ctpio_copy)
            )
        );
    }
    test_field_transmitv_ctpio_copy();
    fn test_field_transmit_alt_select() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transmit_alt_select) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(transmit_alt_select)
            )
        );
    }
    test_field_transmit_alt_select();
    fn test_field_transmit_alt_select_default() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transmit_alt_select_default) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(transmit_alt_select_default)
            )
        );
    }
    test_field_transmit_alt_select_default();
    fn test_field_transmit_alt_stop() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transmit_alt_stop) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(transmit_alt_stop)
            )
        );
    }
    test_field_transmit_alt_stop();
    fn test_field_transmit_alt_go() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transmit_alt_go) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(transmit_alt_go)
            )
        );
    }
    test_field_transmit_alt_go();
    fn test_field_receive_set_discards() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).receive_set_discards) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(receive_set_discards)
            )
        );
    }
    test_field_receive_set_discards();
    fn test_field_receive_get_discards() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).receive_get_discards) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(receive_get_discards)
            )
        );
    }
    test_field_receive_get_discards();
    fn test_field_transmit_alt_discard() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transmit_alt_discard) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(transmit_alt_discard)
            )
        );
    }
    test_field_transmit_alt_discard();
    fn test_field_receive_init() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).receive_init) as usize - ptr as usize
            },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(receive_init)
            )
        );
    }
    test_field_receive_init();
    fn test_field_receive_push() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).receive_push) as usize - ptr as usize
            },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(receive_push)
            )
        );
    }
    test_field_receive_push();
    fn test_field_eventq_poll() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).eventq_poll) as usize - ptr as usize
            },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(eventq_poll)
            )
        );
    }
    test_field_eventq_poll();
    fn test_field_eventq_prime() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).eventq_prime) as usize - ptr as usize
            },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(eventq_prime)
            )
        );
    }
    test_field_eventq_prime();
    fn test_field_eventq_timer_prime() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).eventq_timer_prime) as usize - ptr as usize
            },
            168usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(eventq_timer_prime)
            )
        );
    }
    test_field_eventq_timer_prime();
    fn test_field_eventq_timer_run() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).eventq_timer_run) as usize - ptr as usize
            },
            176usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(eventq_timer_run)
            )
        );
    }
    test_field_eventq_timer_run();
    fn test_field_eventq_timer_clear() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).eventq_timer_clear) as usize - ptr as usize
            },
            184usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(eventq_timer_clear)
            )
        );
    }
    test_field_eventq_timer_clear();
    fn test_field_eventq_timer_zero() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).eventq_timer_zero) as usize - ptr as usize
            },
            192usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(eventq_timer_zero)
            )
        );
    }
    test_field_eventq_timer_zero();
    fn test_field_transmitv_init_extra() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transmitv_init_extra) as usize - ptr as usize
            },
            200usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(transmitv_init_extra)
            )
        );
    }
    test_field_transmitv_init_extra();
    fn test_field_transmit_memcpy() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transmit_memcpy) as usize - ptr as usize
            },
            208usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(transmit_memcpy)
            )
        );
    }
    test_field_transmit_memcpy();
    fn test_field_transmit_memcpy_sync() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transmit_memcpy_sync) as usize - ptr as usize
            },
            216usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(transmit_memcpy_sync)
            )
        );
    }
    test_field_transmit_memcpy_sync();
    fn test_field_transmit_ctpio_fallback() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transmit_ctpio_fallback) as usize - ptr as usize
            },
            224usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(transmit_ctpio_fallback)
            )
        );
    }
    test_field_transmit_ctpio_fallback();
    fn test_field_transmitv_ctpio_fallback() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transmitv_ctpio_fallback) as usize - ptr as usize
            },
            232usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_ops),
                "::",
                stringify!(transmitv_ctpio_fallback)
            )
        );
    }
    test_field_transmitv_ctpio_fallback();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_vi_internal_ops {
    pub post_filter_add: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ef_vi,
            fs: *const ef_filter_spec,
            cookie: *const ef_filter_cookie,
            rxq: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout_ef_vi_internal_ops() {
    assert_eq!(
        ::std::mem::size_of::<ef_vi_internal_ops>(),
        8usize,
        concat!("Size of: ", stringify!(ef_vi_internal_ops))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_vi_internal_ops>(),
        8usize,
        concat!("Alignment of ", stringify!(ef_vi_internal_ops))
    );
    fn test_field_post_filter_add() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_internal_ops>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).post_filter_add) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_internal_ops),
                "::",
                stringify!(post_filter_add)
            )
        );
    }
    test_field_post_filter_add();
}
#[test]
fn bindgen_test_layout_ef_vi() {
    assert_eq!(
        ::std::mem::size_of::<ef_vi>(),
        1128usize,
        concat!("Size of: ", stringify!(ef_vi))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_vi>(),
        8usize,
        concat!("Alignment of ", stringify!(ef_vi))
    );
    fn test_field_inited() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).inited) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(inited)
            )
        );
    }
    test_field_inited();
    fn test_field_vi_resource_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vi_resource_id) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(vi_resource_id)
            )
        );
    }
    test_field_vi_resource_id();
    fn test_field_vi_i() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vi_i) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(vi_i)
            )
        );
    }
    test_field_vi_i();
    fn test_field_abs_idx() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).abs_idx) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(abs_idx)
            )
        );
    }
    test_field_abs_idx();
    fn test_field_dh() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dh) as usize - ptr as usize
            },
            16usize,
            concat!("Offset of field: ", stringify!(ef_vi), "::", stringify!(dh))
        );
    }
    test_field_dh();
    fn test_field_rx_buffer_len() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rx_buffer_len) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(rx_buffer_len)
            )
        );
    }
    test_field_rx_buffer_len();
    fn test_field_rx_prefix_len() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rx_prefix_len) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(rx_prefix_len)
            )
        );
    }
    test_field_rx_prefix_len();
    fn test_field_last_ctpio_failed() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).last_ctpio_failed) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(last_ctpio_failed)
            )
        );
    }
    test_field_last_ctpio_failed();
    fn test_field_rx_discard_mask() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rx_discard_mask) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(rx_discard_mask)
            )
        );
    }
    test_field_rx_discard_mask();
    fn test_field_rx_ts_correction() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rx_ts_correction) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(rx_ts_correction)
            )
        );
    }
    test_field_rx_ts_correction();
    fn test_field_rx_pkt_len_offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rx_pkt_len_offset) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(rx_pkt_len_offset)
            )
        );
    }
    test_field_rx_pkt_len_offset();
    fn test_field_rx_pkt_len_mask() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rx_pkt_len_mask) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(rx_pkt_len_mask)
            )
        );
    }
    test_field_rx_pkt_len_mask();
    fn test_field_tx_ts_correction_ns() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tx_ts_correction_ns) as usize - ptr as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(tx_ts_correction_ns)
            )
        );
    }
    test_field_tx_ts_correction_ns();
    fn test_field_ts_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ts_format) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(ts_format)
            )
        );
    }
    test_field_ts_format();
    fn test_field_vi_mem_mmap_ptr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vi_mem_mmap_ptr) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(vi_mem_mmap_ptr)
            )
        );
    }
    test_field_vi_mem_mmap_ptr();
    fn test_field_vi_mem_mmap_bytes() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vi_mem_mmap_bytes) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(vi_mem_mmap_bytes)
            )
        );
    }
    test_field_vi_mem_mmap_bytes();
    fn test_field_vi_io_mmap_ptr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vi_io_mmap_ptr) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(vi_io_mmap_ptr)
            )
        );
    }
    test_field_vi_io_mmap_ptr();
    fn test_field_vi_io_mmap_bytes() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vi_io_mmap_bytes) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(vi_io_mmap_bytes)
            )
        );
    }
    test_field_vi_io_mmap_bytes();
    fn test_field_vi_ctpio_mmap_ptr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vi_ctpio_mmap_ptr) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(vi_ctpio_mmap_ptr)
            )
        );
    }
    test_field_vi_ctpio_mmap_ptr();
    fn test_field_vi_ctpio_wb_ticks() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vi_ctpio_wb_ticks) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(vi_ctpio_wb_ticks)
            )
        );
    }
    test_field_vi_ctpio_wb_ticks();
    fn test_field_ep_state_bytes() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ep_state_bytes) as usize - ptr as usize
            },
            108usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(ep_state_bytes)
            )
        );
    }
    test_field_ep_state_bytes();
    fn test_field_vi_clustered() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vi_clustered) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(vi_clustered)
            )
        );
    }
    test_field_vi_clustered();
    fn test_field_vi_is_packed_stream() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vi_is_packed_stream) as usize - ptr as usize
            },
            116usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(vi_is_packed_stream)
            )
        );
    }
    test_field_vi_is_packed_stream();
    fn test_field_vi_is_normal() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vi_is_normal) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(vi_is_normal)
            )
        );
    }
    test_field_vi_is_normal();
    fn test_field_vi_ps_buf_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vi_ps_buf_size) as usize - ptr as usize
            },
            124usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(vi_ps_buf_size)
            )
        );
    }
    test_field_vi_ps_buf_size();
    fn test_field_io() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).io) as usize - ptr as usize
            },
            128usize,
            concat!("Offset of field: ", stringify!(ef_vi), "::", stringify!(io))
        );
    }
    test_field_io();
    fn test_field_linked_pio() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).linked_pio) as usize - ptr as usize
            },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(linked_pio)
            )
        );
    }
    test_field_linked_pio();
    fn test_field_evq_base() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).evq_base) as usize - ptr as usize
            },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(evq_base)
            )
        );
    }
    test_field_evq_base();
    fn test_field_evq_mask() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).evq_mask) as usize - ptr as usize
            },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(evq_mask)
            )
        );
    }
    test_field_evq_mask();
    fn test_field_evq_phase_bits() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).evq_phase_bits) as usize - ptr as usize
            },
            156usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(evq_phase_bits)
            )
        );
    }
    test_field_evq_phase_bits();
    fn test_field_timer_quantum_ns() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).timer_quantum_ns) as usize - ptr as usize
            },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(timer_quantum_ns)
            )
        );
    }
    test_field_timer_quantum_ns();
    fn test_field_tx_push_thresh() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tx_push_thresh) as usize - ptr as usize
            },
            164usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(tx_push_thresh)
            )
        );
    }
    test_field_tx_push_thresh();
    fn test_field_vi_txq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vi_txq) as usize - ptr as usize
            },
            168usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(vi_txq)
            )
        );
    }
    test_field_vi_txq();
    fn test_field_vi_rxq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vi_rxq) as usize - ptr as usize
            },
            192usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(vi_rxq)
            )
        );
    }
    test_field_vi_rxq();
    fn test_field_ep_state() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ep_state) as usize - ptr as usize
            },
            216usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(ep_state)
            )
        );
    }
    test_field_ep_state();
    fn test_field_vi_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vi_flags) as usize - ptr as usize
            },
            224usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(vi_flags)
            )
        );
    }
    test_field_vi_flags();
    fn test_field_vi_out_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vi_out_flags) as usize - ptr as usize
            },
            228usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(vi_out_flags)
            )
        );
    }
    test_field_vi_out_flags();
    fn test_field_vi_stats() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vi_stats) as usize - ptr as usize
            },
            232usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(vi_stats)
            )
        );
    }
    test_field_vi_stats();
    fn test_field_vi_qs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vi_qs) as usize - ptr as usize
            },
            240usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(vi_qs)
            )
        );
    }
    test_field_vi_qs();
    fn test_field_vi_qs_n() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vi_qs_n) as usize - ptr as usize
            },
            496usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(vi_qs_n)
            )
        );
    }
    test_field_vi_qs_n();
    fn test_field_future_qid() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).future_qid) as usize - ptr as usize
            },
            500usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(future_qid)
            )
        );
    }
    test_field_future_qid();
    fn test_field_efct_rxq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).efct_rxq) as usize - ptr as usize
            },
            504usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(efct_rxq)
            )
        );
    }
    test_field_efct_rxq();
    fn test_field_efct_shm() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).efct_shm) as usize - ptr as usize
            },
            824usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(efct_shm)
            )
        );
    }
    test_field_efct_shm();
    fn test_field_max_efct_rxq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).max_efct_rxq) as usize - ptr as usize
            },
            832usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(max_efct_rxq)
            )
        );
    }
    test_field_max_efct_rxq();
    fn test_field_tx_alt_num() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tx_alt_num) as usize - ptr as usize
            },
            836usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(tx_alt_num)
            )
        );
    }
    test_field_tx_alt_num();
    fn test_field_tx_alt_id2hw() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tx_alt_id2hw) as usize - ptr as usize
            },
            840usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(tx_alt_id2hw)
            )
        );
    }
    test_field_tx_alt_id2hw();
    fn test_field_tx_alt_hw2id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tx_alt_hw2id) as usize - ptr as usize
            },
            848usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(tx_alt_hw2id)
            )
        );
    }
    test_field_tx_alt_hw2id();
    fn test_field_nic_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nic_type) as usize - ptr as usize
            },
            856usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(nic_type)
            )
        );
    }
    test_field_nic_type();
    fn test_field_xdp_kick() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).xdp_kick) as usize - ptr as usize
            },
            864usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(xdp_kick)
            )
        );
    }
    test_field_xdp_kick();
    fn test_field_xdp_kick_context() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).xdp_kick_context) as usize - ptr as usize
            },
            872usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(xdp_kick_context)
            )
        );
    }
    test_field_xdp_kick_context();
    fn test_field_ops() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ops) as usize - ptr as usize
            },
            880usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(ops)
            )
        );
    }
    test_field_ops();
    fn test_field_internal_ops() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).internal_ops) as usize - ptr as usize
            },
            1120usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi),
                "::",
                stringify!(internal_ops)
            )
        );
    }
    test_field_internal_ops();
}
extern "C" {
    pub fn ef_vi_version_str() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn ef_vi_driver_interface_str() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn ef_vi_receive_post(
        vi: *mut ef_vi,
        addr: ef_addr,
        dma_id: ef_request_id,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_receive_get_timestamp(
        vi: *mut ef_vi,
        pkt: *const ::std::os::raw::c_void,
        ts_out: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_receive_get_timestamp_with_sync_flags(
        vi: *mut ef_vi,
        pkt: *const ::std::os::raw::c_void,
        ts_out: *mut timespec,
        flags_out: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_receive_get_bytes(
        vi: *mut ef_vi,
        pkt: *const ::std::os::raw::c_void,
        bytes_out: *mut u16,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_receive_get_user_data(
        vi: *mut ef_vi,
        pkt: *const ::std::os::raw::c_void,
        user_mark: *mut u32,
        user_flag: *mut u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_receive_unbundle(
        ep: *mut ef_vi,
        event: *const ef_event,
        ids: *mut ef_request_id,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_rxq_next_desc_id(vi: *mut ef_vi) -> ef_request_id;
}
extern "C" {
    pub fn ef_vi_transmit_init(
        vi: *mut ef_vi,
        addr: ef_addr,
        bytes: ::std::os::raw::c_int,
        dma_id: ef_request_id,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_transmit_init_undo(vi: *mut ef_vi);
}
extern "C" {
    pub fn ef_vi_transmit_unbundle(
        ep: *mut ef_vi,
        event: *const ef_event,
        ids: *mut ef_request_id,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_transmit_alt_num_ids(vi: *mut ef_vi) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn ef_vi_transmit_alt_query_overhead(
        vi: *mut ef_vi,
        params: *mut ef_vi_transmit_alt_overhead,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_set_tx_push_threshold(vi: *mut ef_vi, threshold: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn ef_eventq_check_event(
        vi: *const ef_vi,
        look_ahead: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_eventq_check_event_phase_bit(
        vi: *const ef_vi,
        look_ahead: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn efxdp_ef_eventq_check_event(
        vi: *const ef_vi,
        look_ahead: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn efct_ef_eventq_check_event(vi: *const ef_vi) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_eventq_capacity(vi: *mut ef_vi) -> ::std::os::raw::c_int;
}
pub const ef_vi_layout_type_EF_VI_LAYOUT_FRAME: ef_vi_layout_type = 0;
pub const ef_vi_layout_type_EF_VI_LAYOUT_MINOR_TICKS: ef_vi_layout_type = 1;
pub const ef_vi_layout_type_EF_VI_LAYOUT_PACKET_LENGTH: ef_vi_layout_type = 2;
pub type ef_vi_layout_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_vi_layout_entry {
    pub evle_type: ef_vi_layout_type,
    pub evle_offset: ::std::os::raw::c_int,
    pub evle_description: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_ef_vi_layout_entry() {
    assert_eq!(
        ::std::mem::size_of::<ef_vi_layout_entry>(),
        16usize,
        concat!("Size of: ", stringify!(ef_vi_layout_entry))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_vi_layout_entry>(),
        8usize,
        concat!("Alignment of ", stringify!(ef_vi_layout_entry))
    );
    fn test_field_evle_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_layout_entry>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).evle_type) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_layout_entry),
                "::",
                stringify!(evle_type)
            )
        );
    }
    test_field_evle_type();
    fn test_field_evle_offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_layout_entry>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).evle_offset) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_layout_entry),
                "::",
                stringify!(evle_offset)
            )
        );
    }
    test_field_evle_offset();
    fn test_field_evle_description() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_layout_entry>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).evle_description) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_layout_entry),
                "::",
                stringify!(evle_description)
            )
        );
    }
    test_field_evle_description();
}
extern "C" {
    pub fn ef_vi_receive_query_layout(
        vi: *mut ef_vi,
        layout_out: *mut *const ef_vi_layout_entry,
        layout_len_out: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_receive_get_discard_flags(
        vi: *mut ef_vi,
        pkt: *const ::std::os::raw::c_void,
        discard_flags: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_eventq_wait(
        vi: *mut ef_vi,
        vi_dh: ef_driver_handle,
        current_ptr: ::std::os::raw::c_uint,
        timeout: *const timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_driver_open(dh_out: *mut ef_driver_handle) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_driver_close(dh: ef_driver_handle) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_alloc_from_pd(
        vi: *mut ef_vi,
        vi_dh: ef_driver_handle,
        pd: *mut ef_pd,
        pd_dh: ef_driver_handle,
        evq_capacity: ::std::os::raw::c_int,
        rxq_capacity: ::std::os::raw::c_int,
        txq_capacity: ::std::os::raw::c_int,
        evq_opt: *mut ef_vi,
        evq_dh: ef_driver_handle,
        flags: ef_vi_flags,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_free(vi: *mut ef_vi, nic: ef_driver_handle) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_transmit_alt_alloc(
        vi: *mut ef_vi,
        vi_dh: ef_driver_handle,
        num_alts: ::std::os::raw::c_int,
        buf_space: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_transmit_alt_free(
        vi: *mut ef_vi,
        vi_dh: ef_driver_handle,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_transmit_alt_query_buffering(
        vi: *mut ef_vi,
        ifindex: ::std::os::raw::c_int,
        vi_dh: ef_driver_handle,
        n_alts: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_flush(vi: *mut ef_vi, nic: ef_driver_handle) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_pace(
        vi: *mut ef_vi,
        nic: ef_driver_handle,
        val: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_mtu(vi: *mut ef_vi, vi_dh: ef_driver_handle) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn ef_vi_get_mac(
        vi: *mut ef_vi,
        vi_dh: ef_driver_handle,
        mac_out: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_eventq_put(
        resource_id: ::std::os::raw::c_uint,
        evq_dh: ef_driver_handle,
        ev_bits: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_vi_set {
    pub vis_res_id: ::std::os::raw::c_uint,
    pub vis_pd: *mut ef_pd,
}
#[test]
fn bindgen_test_layout_ef_vi_set() {
    assert_eq!(
        ::std::mem::size_of::<ef_vi_set>(),
        16usize,
        concat!("Size of: ", stringify!(ef_vi_set))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_vi_set>(),
        8usize,
        concat!("Alignment of ", stringify!(ef_vi_set))
    );
    fn test_field_vis_res_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_set>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vis_res_id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_set),
                "::",
                stringify!(vis_res_id)
            )
        );
    }
    test_field_vis_res_id();
    fn test_field_vis_pd() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_set>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vis_pd) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_set),
                "::",
                stringify!(vis_pd)
            )
        );
    }
    test_field_vis_pd();
}
extern "C" {
    pub fn ef_vi_set_alloc_from_pd(
        vi_set: *mut ef_vi_set,
        vi_set_dh: ef_driver_handle,
        pd: *mut ef_pd,
        pd_dh: ef_driver_handle,
        n_vis: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_set_free(
        vi_set: *mut ef_vi_set,
        vi_set_dh: ef_driver_handle,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_alloc_from_set(
        vi: *mut ef_vi,
        vi_dh: ef_driver_handle,
        vi_set: *mut ef_vi_set,
        vi_set_dh: ef_driver_handle,
        index_in_vi_set: ::std::os::raw::c_int,
        evq_capacity: ::std::os::raw::c_int,
        rxq_capacity: ::std::os::raw::c_int,
        txq_capacity: ::std::os::raw::c_int,
        evq_opt: *mut ef_vi,
        evq_dh: ef_driver_handle,
        flags: ef_vi_flags,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_prime(
        vi: *mut ef_vi,
        dh: ef_driver_handle,
        current_ptr: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
pub const ef_filter_flags_EF_FILTER_FLAG_NONE: ef_filter_flags = 0;
pub const ef_filter_flags_EF_FILTER_FLAG_MCAST_LOOP_RECEIVE: ef_filter_flags = 2;
pub type ef_filter_flags = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_filter_spec {
    pub type_: ::std::os::raw::c_uint,
    pub flags: ::std::os::raw::c_uint,
    pub data: [::std::os::raw::c_uint; 12usize],
}
#[test]
fn bindgen_test_layout_ef_filter_spec() {
    assert_eq!(
        ::std::mem::size_of::<ef_filter_spec>(),
        56usize,
        concat!("Size of: ", stringify!(ef_filter_spec))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_filter_spec>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_filter_spec))
    );
    fn test_field_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_filter_spec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_filter_spec),
                "::",
                stringify!(type_)
            )
        );
    }
    test_field_type();
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_filter_spec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_filter_spec),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
    fn test_field_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_filter_spec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_filter_spec),
                "::",
                stringify!(data)
            )
        );
    }
    test_field_data();
}
pub const EF_FILTER_VLAN_ID_ANY: _bindgen_ty_4 = -1;
pub type _bindgen_ty_4 = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_filter_cookie {
    pub filter_id: ::std::os::raw::c_int,
    pub filter_type: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ef_filter_cookie() {
    assert_eq!(
        ::std::mem::size_of::<ef_filter_cookie>(),
        8usize,
        concat!("Size of: ", stringify!(ef_filter_cookie))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_filter_cookie>(),
        4usize,
        concat!("Alignment of ", stringify!(ef_filter_cookie))
    );
    fn test_field_filter_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_filter_cookie>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).filter_id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_filter_cookie),
                "::",
                stringify!(filter_id)
            )
        );
    }
    test_field_filter_id();
    fn test_field_filter_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_filter_cookie>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).filter_type) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_filter_cookie),
                "::",
                stringify!(filter_type)
            )
        );
    }
    test_field_filter_type();
}
extern "C" {
    pub fn ef_filter_spec_init(filter_spec: *mut ef_filter_spec, flags: ef_filter_flags);
}
extern "C" {
    pub fn ef_filter_spec_set_ip4_local(
        filter_spec: *mut ef_filter_spec,
        protocol: ::std::os::raw::c_int,
        host_be32: ::std::os::raw::c_uint,
        port_be16: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_filter_spec_set_ip4_full(
        filter_spec: *mut ef_filter_spec,
        protocol: ::std::os::raw::c_int,
        host_be32: ::std::os::raw::c_uint,
        port_be16: ::std::os::raw::c_int,
        rhost_be32: ::std::os::raw::c_uint,
        rport_be16: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_filter_spec_set_ip6_local(
        filter_spec: *mut ef_filter_spec,
        protocol: ::std::os::raw::c_int,
        host: *const in6_addr,
        port_be16: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_filter_spec_set_ip6_full(
        filter_spec: *mut ef_filter_spec,
        protocol: ::std::os::raw::c_int,
        host: *const in6_addr,
        port_be16: ::std::os::raw::c_int,
        rhost: *const in6_addr,
        rport_be16: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_filter_spec_set_vlan(
        filter_spec: *mut ef_filter_spec,
        vlan_id: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_filter_spec_set_eth_local(
        filter_spec: *mut ef_filter_spec,
        vlan_id: ::std::os::raw::c_int,
        mac: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_filter_spec_set_unicast_all(
        filter_spec: *mut ef_filter_spec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_filter_spec_set_multicast_all(
        filter_spec: *mut ef_filter_spec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_filter_spec_set_unicast_mismatch(
        filter_spec: *mut ef_filter_spec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_filter_spec_set_multicast_mismatch(
        filter_spec: *mut ef_filter_spec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_filter_spec_set_port_sniff(
        filter_spec: *mut ef_filter_spec,
        promiscuous: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_filter_spec_set_tx_port_sniff(
        filter_spec: *mut ef_filter_spec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_filter_spec_set_block_kernel(
        filter_spec: *mut ef_filter_spec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_filter_spec_set_block_kernel_multicast(
        filter_spec: *mut ef_filter_spec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_filter_spec_set_eth_type(
        filter_spec: *mut ef_filter_spec,
        ether_type_be16: u16,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_filter_spec_set_ip_proto(
        filter_spec: *mut ef_filter_spec,
        ip_proto: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_filter_spec_set_user_mark(
        filter_spec: *mut ef_filter_spec,
        user_mark: u32,
        bitwise_or: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_filter_spec_set_user_flag(
        filter_spec: *mut ef_filter_spec,
        user_flag: u8,
        bitwise_or: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_filter_spec_set_block_kernel_unicast(
        filter_spec: *mut ef_filter_spec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_filter_spec_set_dest(
        filter_spec: *mut ef_filter_spec,
        dest: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_filter_add(
        vi: *mut ef_vi,
        vi_dh: ef_driver_handle,
        filter_spec: *const ef_filter_spec,
        filter_cookie_out: *mut ef_filter_cookie,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_filter_del(
        vi: *mut ef_vi,
        vi_dh: ef_driver_handle,
        filter_cookie: *mut ef_filter_cookie,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_set_filter_add(
        vi_set: *mut ef_vi_set,
        vi_set_dh: ef_driver_handle,
        filter_spec: *const ef_filter_spec,
        filter_cookie_out: *mut ef_filter_cookie,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_set_filter_del(
        vi_set: *mut ef_vi_set,
        vi_set_dh: ef_driver_handle,
        filter_cookie: *mut ef_filter_cookie,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_vi_stats_field_layout {
    pub evsfl_name: *mut ::std::os::raw::c_char,
    pub evsfl_offset: ::std::os::raw::c_int,
    pub evsfl_size: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ef_vi_stats_field_layout() {
    assert_eq!(
        ::std::mem::size_of::<ef_vi_stats_field_layout>(),
        16usize,
        concat!("Size of: ", stringify!(ef_vi_stats_field_layout))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_vi_stats_field_layout>(),
        8usize,
        concat!("Alignment of ", stringify!(ef_vi_stats_field_layout))
    );
    fn test_field_evsfl_name() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_stats_field_layout>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).evsfl_name) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_stats_field_layout),
                "::",
                stringify!(evsfl_name)
            )
        );
    }
    test_field_evsfl_name();
    fn test_field_evsfl_offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_stats_field_layout>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).evsfl_offset) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_stats_field_layout),
                "::",
                stringify!(evsfl_offset)
            )
        );
    }
    test_field_evsfl_offset();
    fn test_field_evsfl_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_stats_field_layout>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).evsfl_size) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_stats_field_layout),
                "::",
                stringify!(evsfl_size)
            )
        );
    }
    test_field_evsfl_size();
}
#[repr(C)]
#[derive(Debug)]
pub struct ef_vi_stats_layout {
    pub evsl_data_size: ::std::os::raw::c_int,
    pub evsl_fields_num: ::std::os::raw::c_int,
    pub evsl_fields: __IncompleteArrayField<ef_vi_stats_field_layout>,
}
#[test]
fn bindgen_test_layout_ef_vi_stats_layout() {
    assert_eq!(
        ::std::mem::size_of::<ef_vi_stats_layout>(),
        8usize,
        concat!("Size of: ", stringify!(ef_vi_stats_layout))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_vi_stats_layout>(),
        8usize,
        concat!("Alignment of ", stringify!(ef_vi_stats_layout))
    );
    fn test_field_evsl_data_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_stats_layout>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).evsl_data_size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_stats_layout),
                "::",
                stringify!(evsl_data_size)
            )
        );
    }
    test_field_evsl_data_size();
    fn test_field_evsl_fields_num() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_stats_layout>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).evsl_fields_num) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_stats_layout),
                "::",
                stringify!(evsl_fields_num)
            )
        );
    }
    test_field_evsl_fields_num();
    fn test_field_evsl_fields() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_vi_stats_layout>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).evsl_fields) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_vi_stats_layout),
                "::",
                stringify!(evsl_fields)
            )
        );
    }
    test_field_evsl_fields();
}
extern "C" {
    pub fn ef_vi_stats_query_layout(
        vi: *mut ef_vi,
        layout_out: *mut *const ef_vi_stats_layout,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_stats_query(
        vi: *mut ef_vi,
        vi_dh: ef_driver_handle,
        data: *mut ::std::os::raw::c_void,
        do_reset: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub const ef_pd_flags_EF_PD_DEFAULT: ef_pd_flags = 0;
pub const ef_pd_flags_EF_PD_VF: ef_pd_flags = 1;
pub const ef_pd_flags_EF_PD_PHYS_MODE: ef_pd_flags = 2;
pub const ef_pd_flags_EF_PD_RX_PACKED_STREAM: ef_pd_flags = 4;
pub const ef_pd_flags_EF_PD_VPORT: ef_pd_flags = 8;
pub const ef_pd_flags_EF_PD_MCAST_LOOP: ef_pd_flags = 16;
pub const ef_pd_flags_EF_PD_MEMREG_64KiB: ef_pd_flags = 32;
pub const ef_pd_flags_EF_PD_IGNORE_BLACKLIST: ef_pd_flags = 64;
pub type ef_pd_flags = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_pd {
    pub pd_flags: ef_pd_flags,
    pub pd_resource_id: ::std::os::raw::c_uint,
    pub pd_intf_name: *mut ::std::os::raw::c_char,
    pub pd_cluster_name: *mut ::std::os::raw::c_char,
    pub pd_cluster_sock: ::std::os::raw::c_int,
    pub pd_cluster_dh: ef_driver_handle,
    pub pd_cluster_viset_resource_id: ::std::os::raw::c_uint,
    pub pd_cluster_viset_index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ef_pd() {
    assert_eq!(
        ::std::mem::size_of::<ef_pd>(),
        40usize,
        concat!("Size of: ", stringify!(ef_pd))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_pd>(),
        8usize,
        concat!("Alignment of ", stringify!(ef_pd))
    );
    fn test_field_pd_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_pd>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pd_flags) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_pd),
                "::",
                stringify!(pd_flags)
            )
        );
    }
    test_field_pd_flags();
    fn test_field_pd_resource_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_pd>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pd_resource_id) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_pd),
                "::",
                stringify!(pd_resource_id)
            )
        );
    }
    test_field_pd_resource_id();
    fn test_field_pd_intf_name() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_pd>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pd_intf_name) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_pd),
                "::",
                stringify!(pd_intf_name)
            )
        );
    }
    test_field_pd_intf_name();
    fn test_field_pd_cluster_name() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_pd>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pd_cluster_name) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_pd),
                "::",
                stringify!(pd_cluster_name)
            )
        );
    }
    test_field_pd_cluster_name();
    fn test_field_pd_cluster_sock() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_pd>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pd_cluster_sock) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_pd),
                "::",
                stringify!(pd_cluster_sock)
            )
        );
    }
    test_field_pd_cluster_sock();
    fn test_field_pd_cluster_dh() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_pd>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pd_cluster_dh) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_pd),
                "::",
                stringify!(pd_cluster_dh)
            )
        );
    }
    test_field_pd_cluster_dh();
    fn test_field_pd_cluster_viset_resource_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_pd>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pd_cluster_viset_resource_id) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_pd),
                "::",
                stringify!(pd_cluster_viset_resource_id)
            )
        );
    }
    test_field_pd_cluster_viset_resource_id();
    fn test_field_pd_cluster_viset_index() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_pd>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pd_cluster_viset_index) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_pd),
                "::",
                stringify!(pd_cluster_viset_index)
            )
        );
    }
    test_field_pd_cluster_viset_index();
}
extern "C" {
    pub fn ef_pd_alloc(
        pd: *mut ef_pd,
        pd_dh: ef_driver_handle,
        ifindex: ::std::os::raw::c_int,
        flags: ef_pd_flags,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_pd_alloc_by_name(
        pd: *mut ef_pd,
        pd_dh: ef_driver_handle,
        cluster_or_intf_name: *const ::std::os::raw::c_char,
        flags: ef_pd_flags,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_pd_alloc_with_vport(
        pd: *mut ef_pd,
        pd_dh: ef_driver_handle,
        intf_name: *const ::std::os::raw::c_char,
        flags: ef_pd_flags,
        vlan_id: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_pd_interface_name(pd: *mut ef_pd) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn ef_pd_free(pd: *mut ef_pd, pd_dh: ef_driver_handle) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_pio {
    pub pio_buffer: *mut u8,
    pub pio_io: *mut u8,
    pub pio_resource_id: ::std::os::raw::c_uint,
    pub pio_len: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_ef_pio() {
    assert_eq!(
        ::std::mem::size_of::<ef_pio>(),
        24usize,
        concat!("Size of: ", stringify!(ef_pio))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_pio>(),
        8usize,
        concat!("Alignment of ", stringify!(ef_pio))
    );
    fn test_field_pio_buffer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_pio>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pio_buffer) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_pio),
                "::",
                stringify!(pio_buffer)
            )
        );
    }
    test_field_pio_buffer();
    fn test_field_pio_io() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_pio>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pio_io) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_pio),
                "::",
                stringify!(pio_io)
            )
        );
    }
    test_field_pio_io();
    fn test_field_pio_resource_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_pio>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pio_resource_id) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_pio),
                "::",
                stringify!(pio_resource_id)
            )
        );
    }
    test_field_pio_resource_id();
    fn test_field_pio_len() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_pio>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pio_len) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_pio),
                "::",
                stringify!(pio_len)
            )
        );
    }
    test_field_pio_len();
}
extern "C" {
    pub fn ef_pio_alloc(
        pio: *mut ef_pio,
        pio_dh: ef_driver_handle,
        pd: *mut ef_pd,
        len_hint: ::std::os::raw::c_uint,
        pd_dh: ef_driver_handle,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_vi_get_pio_size(vi: *mut ef_vi) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_pio_free(pio: *mut ef_pio, pio_dh: ef_driver_handle) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_pio_link_vi(
        pio: *mut ef_pio,
        pio_dh: ef_driver_handle,
        vi: *mut ef_vi,
        vi_dh: ef_driver_handle,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_pio_unlink_vi(
        pio: *mut ef_pio,
        pio_dh: ef_driver_handle,
        vi: *mut ef_vi,
        vi_dh: ef_driver_handle,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_pio_memcpy(
        vi: *mut ef_vi,
        base: *const ::std::os::raw::c_void,
        offset: ::std::os::raw::c_int,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ef_memreg {
    pub mr_dma_addrs: *mut ef_addr,
    pub mr_dma_addrs_base: *mut ef_addr,
}
#[test]
fn bindgen_test_layout_ef_memreg() {
    assert_eq!(
        ::std::mem::size_of::<ef_memreg>(),
        16usize,
        concat!("Size of: ", stringify!(ef_memreg))
    );
    assert_eq!(
        ::std::mem::align_of::<ef_memreg>(),
        8usize,
        concat!("Alignment of ", stringify!(ef_memreg))
    );
    fn test_field_mr_dma_addrs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_memreg>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mr_dma_addrs) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_memreg),
                "::",
                stringify!(mr_dma_addrs)
            )
        );
    }
    test_field_mr_dma_addrs();
    fn test_field_mr_dma_addrs_base() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ef_memreg>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mr_dma_addrs_base) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ef_memreg),
                "::",
                stringify!(mr_dma_addrs_base)
            )
        );
    }
    test_field_mr_dma_addrs_base();
}
extern "C" {
    pub fn ef_memreg_alloc(
        mr: *mut ef_memreg,
        mr_dh: ef_driver_handle,
        pd: *mut ef_pd,
        pd_dh: ef_driver_handle,
        p_mem: *mut ::std::os::raw::c_void,
        len_bytes: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ef_memreg_free(mr: *mut ef_memreg, mr_dh: ef_driver_handle) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct zf_stack {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct zf_attr {
    _unused: [u8; 0],
}
extern "C" {
    pub fn zf_init() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zf_deinit() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zf_stack_alloc(
        attr: *mut zf_attr,
        stack_out: *mut *mut zf_stack,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zf_stack_free(stack: *mut zf_stack) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct zf_waitable {
    _unused: [u8; 0],
}
extern "C" {
    pub fn zf_stack_to_waitable(arg1: *mut zf_stack) -> *mut zf_waitable;
}
extern "C" {
    pub fn zf_stack_is_quiescent(arg1: *mut zf_stack) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zf_version() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn zf_version_short() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn onload_version_short() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn zf_print_version();
}
pub const zf_stack_feature_CTPIO: zf_stack_feature = 0;
pub const zf_stack_feature_PIO: zf_stack_feature = 1;
pub type zf_stack_feature = ::std::os::raw::c_uint;
extern "C" {
    pub fn zf_stack_query_feature(
        stack: *mut zf_stack,
        feature: zf_stack_feature,
    ) -> ::std::os::raw::c_int;
}
pub const EPOLL_CLOEXEC: _bindgen_ty_5 = 524288;
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
pub const EPOLL_EVENTS_EPOLLIN: EPOLL_EVENTS = 1;
pub const EPOLL_EVENTS_EPOLLPRI: EPOLL_EVENTS = 2;
pub const EPOLL_EVENTS_EPOLLOUT: EPOLL_EVENTS = 4;
pub const EPOLL_EVENTS_EPOLLRDNORM: EPOLL_EVENTS = 64;
pub const EPOLL_EVENTS_EPOLLRDBAND: EPOLL_EVENTS = 128;
pub const EPOLL_EVENTS_EPOLLWRNORM: EPOLL_EVENTS = 256;
pub const EPOLL_EVENTS_EPOLLWRBAND: EPOLL_EVENTS = 512;
pub const EPOLL_EVENTS_EPOLLMSG: EPOLL_EVENTS = 1024;
pub const EPOLL_EVENTS_EPOLLERR: EPOLL_EVENTS = 8;
pub const EPOLL_EVENTS_EPOLLHUP: EPOLL_EVENTS = 16;
pub const EPOLL_EVENTS_EPOLLRDHUP: EPOLL_EVENTS = 8192;
pub const EPOLL_EVENTS_EPOLLEXCLUSIVE: EPOLL_EVENTS = 268435456;
pub const EPOLL_EVENTS_EPOLLWAKEUP: EPOLL_EVENTS = 536870912;
pub const EPOLL_EVENTS_EPOLLONESHOT: EPOLL_EVENTS = 1073741824;
pub const EPOLL_EVENTS_EPOLLET: EPOLL_EVENTS = 2147483648;
pub type EPOLL_EVENTS = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub union epoll_data {
    pub ptr: *mut ::std::os::raw::c_void,
    pub fd: ::std::os::raw::c_int,
    pub u32_: u32,
    pub u64_: u64,
}
#[test]
fn bindgen_test_layout_epoll_data() {
    assert_eq!(
        ::std::mem::size_of::<epoll_data>(),
        8usize,
        concat!("Size of: ", stringify!(epoll_data))
    );
    assert_eq!(
        ::std::mem::align_of::<epoll_data>(),
        8usize,
        concat!("Alignment of ", stringify!(epoll_data))
    );
    fn test_field_ptr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<epoll_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ptr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(epoll_data),
                "::",
                stringify!(ptr)
            )
        );
    }
    test_field_ptr();
    fn test_field_fd() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<epoll_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fd) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(epoll_data),
                "::",
                stringify!(fd)
            )
        );
    }
    test_field_fd();
    fn test_field_u32() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<epoll_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).u32_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(epoll_data),
                "::",
                stringify!(u32_)
            )
        );
    }
    test_field_u32();
    fn test_field_u64() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<epoll_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).u64_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(epoll_data),
                "::",
                stringify!(u64_)
            )
        );
    }
    test_field_u64();
}
pub type epoll_data_t = epoll_data;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct epoll_event {
    pub events: u32,
    pub data: epoll_data_t,
}
#[test]
fn bindgen_test_layout_epoll_event() {
    assert_eq!(
        ::std::mem::size_of::<epoll_event>(),
        12usize,
        concat!("Size of: ", stringify!(epoll_event))
    );
    assert_eq!(
        ::std::mem::align_of::<epoll_event>(),
        1usize,
        concat!("Alignment of ", stringify!(epoll_event))
    );
    fn test_field_events() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<epoll_event>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).events) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(epoll_event),
                "::",
                stringify!(events)
            )
        );
    }
    test_field_events();
    fn test_field_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<epoll_event>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(epoll_event),
                "::",
                stringify!(data)
            )
        );
    }
    test_field_data();
}
extern "C" {
    pub fn epoll_create(__size: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn epoll_create1(__flags: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn epoll_ctl(
        __epfd: ::std::os::raw::c_int,
        __op: ::std::os::raw::c_int,
        __fd: ::std::os::raw::c_int,
        __event: *mut epoll_event,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn epoll_wait(
        __epfd: ::std::os::raw::c_int,
        __events: *mut epoll_event,
        __maxevents: ::std::os::raw::c_int,
        __timeout: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn epoll_pwait(
        __epfd: ::std::os::raw::c_int,
        __events: *mut epoll_event,
        __maxevents: ::std::os::raw::c_int,
        __timeout: ::std::os::raw::c_int,
        __ss: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct zf_muxer_set {
    _unused: [u8; 0],
}
extern "C" {
    pub fn zf_muxer_alloc(
        stack: *mut zf_stack,
        muxer_out: *mut *mut zf_muxer_set,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zf_muxer_free(muxer: *mut zf_muxer_set);
}
extern "C" {
    pub fn zf_muxer_add(
        muxer: *mut zf_muxer_set,
        w: *mut zf_waitable,
        event: *const epoll_event,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zf_muxer_mod(w: *mut zf_waitable, event: *const epoll_event) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zf_muxer_del(w: *mut zf_waitable) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zf_muxer_wait(
        muxer: *mut zf_muxer_set,
        events: *mut epoll_event,
        maxevents: ::std::os::raw::c_int,
        timeout_ns: i64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zf_waitable_event(w: *mut zf_waitable) -> *const epoll_event;
}
extern "C" {
    pub fn zf_waitable_fd_get(
        stack: *mut zf_stack,
        fd: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zf_waitable_fd_prime(stack: *mut zf_stack) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zf_attr_alloc(attr_out: *mut *mut zf_attr) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zf_attr_free(attr: *mut zf_attr);
}
extern "C" {
    pub fn zf_attr_reset(attr: *mut zf_attr);
}
extern "C" {
    pub fn zf_attr_set_int(
        attr: *mut zf_attr,
        name: *const ::std::os::raw::c_char,
        val: i64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zf_attr_get_int(
        attr: *mut zf_attr,
        name: *const ::std::os::raw::c_char,
        val: *mut i64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zf_attr_set_str(
        attr: *mut zf_attr,
        name: *const ::std::os::raw::c_char,
        val: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zf_attr_get_str(
        attr: *mut zf_attr,
        name: *const ::std::os::raw::c_char,
        val: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zf_attr_set_from_str(
        attr: *mut zf_attr,
        name: *const ::std::os::raw::c_char,
        val: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zf_attr_set_from_fmt(
        attr: *mut zf_attr,
        name: *const ::std::os::raw::c_char,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zf_attr_dup(attr: *const zf_attr) -> *mut zf_attr;
}
extern "C" {
    pub fn zf_attr_doc(
        attr_name_opt: *const ::std::os::raw::c_char,
        docs_out: *mut *mut *const ::std::os::raw::c_char,
        docs_len_out: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type socklen_t = __socklen_t;
pub const __socket_type_SOCK_STREAM: __socket_type = 1;
pub const __socket_type_SOCK_DGRAM: __socket_type = 2;
pub const __socket_type_SOCK_RAW: __socket_type = 3;
pub const __socket_type_SOCK_RDM: __socket_type = 4;
pub const __socket_type_SOCK_SEQPACKET: __socket_type = 5;
pub const __socket_type_SOCK_DCCP: __socket_type = 6;
pub const __socket_type_SOCK_PACKET: __socket_type = 10;
pub const __socket_type_SOCK_CLOEXEC: __socket_type = 524288;
pub const __socket_type_SOCK_NONBLOCK: __socket_type = 2048;
pub type __socket_type = ::std::os::raw::c_uint;
pub type sa_family_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr {
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[test]
fn bindgen_test_layout_sockaddr() {
    assert_eq!(
        ::std::mem::size_of::<sockaddr>(),
        16usize,
        concat!("Size of: ", stringify!(sockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr>(),
        2usize,
        concat!("Alignment of ", stringify!(sockaddr))
    );
    fn test_field_sa_family() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sockaddr>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sa_family) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(sockaddr),
                "::",
                stringify!(sa_family)
            )
        );
    }
    test_field_sa_family();
    fn test_field_sa_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sockaddr>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sa_data) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(sockaddr),
                "::",
                stringify!(sa_data)
            )
        );
    }
    test_field_sa_data();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_storage {
    pub ss_family: sa_family_t,
    pub __ss_padding: [::std::os::raw::c_char; 118usize],
    pub __ss_align: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_sockaddr_storage() {
    assert_eq!(
        ::std::mem::size_of::<sockaddr_storage>(),
        128usize,
        concat!("Size of: ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_storage>(),
        8usize,
        concat!("Alignment of ", stringify!(sockaddr_storage))
    );
    fn test_field_ss_family() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sockaddr_storage>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ss_family) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(sockaddr_storage),
                "::",
                stringify!(ss_family)
            )
        );
    }
    test_field_ss_family();
    fn test_field___ss_padding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sockaddr_storage>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__ss_padding) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(sockaddr_storage),
                "::",
                stringify!(__ss_padding)
            )
        );
    }
    test_field___ss_padding();
    fn test_field___ss_align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<sockaddr_storage>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__ss_align) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(sockaddr_storage),
                "::",
                stringify!(__ss_align)
            )
        );
    }
    test_field___ss_align();
}
pub const MSG_OOB: _bindgen_ty_6 = 1;
pub const MSG_PEEK: _bindgen_ty_6 = 2;
pub const MSG_DONTROUTE: _bindgen_ty_6 = 4;
pub const MSG_CTRUNC: _bindgen_ty_6 = 8;
pub const MSG_PROXY: _bindgen_ty_6 = 16;
pub const MSG_TRUNC: _bindgen_ty_6 = 32;
pub const MSG_DONTWAIT: _bindgen_ty_6 = 64;
pub const MSG_EOR: _bindgen_ty_6 = 128;
pub const MSG_WAITALL: _bindgen_ty_6 = 256;
pub const MSG_FIN: _bindgen_ty_6 = 512;
pub const MSG_SYN: _bindgen_ty_6 = 1024;
pub const MSG_CONFIRM: _bindgen_ty_6 = 2048;
pub const MSG_RST: _bindgen_ty_6 = 4096;
pub const MSG_ERRQUEUE: _bindgen_ty_6 = 8192;
pub const MSG_NOSIGNAL: _bindgen_ty_6 = 16384;
pub const MSG_MORE: _bindgen_ty_6 = 32768;
pub const MSG_WAITFORONE: _bindgen_ty_6 = 65536;
pub const MSG_BATCH: _bindgen_ty_6 = 262144;
pub const MSG_ZEROCOPY: _bindgen_ty_6 = 67108864;
pub const MSG_FASTOPEN: _bindgen_ty_6 = 536870912;
pub const MSG_CMSG_CLOEXEC: _bindgen_ty_6 = 1073741824;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msghdr {
    pub msg_name: *mut ::std::os::raw::c_void,
    pub msg_namelen: socklen_t,
    pub msg_iov: *mut iovec,
    pub msg_iovlen: size_t,
    pub msg_control: *mut ::std::os::raw::c_void,
    pub msg_controllen: size_t,
    pub msg_flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_msghdr() {
    assert_eq!(
        ::std::mem::size_of::<msghdr>(),
        56usize,
        concat!("Size of: ", stringify!(msghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<msghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(msghdr))
    );
    fn test_field_msg_name() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<msghdr>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).msg_name) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(msghdr),
                "::",
                stringify!(msg_name)
            )
        );
    }
    test_field_msg_name();
    fn test_field_msg_namelen() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<msghdr>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).msg_namelen) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(msghdr),
                "::",
                stringify!(msg_namelen)
            )
        );
    }
    test_field_msg_namelen();
    fn test_field_msg_iov() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<msghdr>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).msg_iov) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(msghdr),
                "::",
                stringify!(msg_iov)
            )
        );
    }
    test_field_msg_iov();
    fn test_field_msg_iovlen() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<msghdr>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).msg_iovlen) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(msghdr),
                "::",
                stringify!(msg_iovlen)
            )
        );
    }
    test_field_msg_iovlen();
    fn test_field_msg_control() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<msghdr>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).msg_control) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(msghdr),
                "::",
                stringify!(msg_control)
            )
        );
    }
    test_field_msg_control();
    fn test_field_msg_controllen() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<msghdr>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).msg_controllen) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(msghdr),
                "::",
                stringify!(msg_controllen)
            )
        );
    }
    test_field_msg_controllen();
    fn test_field_msg_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<msghdr>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).msg_flags) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(msghdr),
                "::",
                stringify!(msg_flags)
            )
        );
    }
    test_field_msg_flags();
}
#[repr(C)]
#[derive(Debug)]
pub struct cmsghdr {
    pub cmsg_len: size_t,
    pub cmsg_level: ::std::os::raw::c_int,
    pub cmsg_type: ::std::os::raw::c_int,
    pub __cmsg_data: __IncompleteArrayField<::std::os::raw::c_uchar>,
}
#[test]
fn bindgen_test_layout_cmsghdr() {
    assert_eq!(
        ::std::mem::size_of::<cmsghdr>(),
